
/** example
<div class="form-group">
    <label for="field_state" class="control-label col-md-2">*商品产地:</label>
    <div class="col-md-3">
        <!-- data-default="日本"-->
        <select id="field_state" name="field_state" data-role="region" data-default="日本" required class="form-control">
            <option value="">选择国家</option>
        </select>
    </div>
    <div class="col-md-3">
        <select id="field_province" name="field_province" data-role="region" data-default="东京都" required class="form-control">
            <option value="">选择省份</option>
        </select>
    </div>
    <div class="col-md-3">
        <select id="field_city" name="field_city" data-role="region" data-default="东京" required class="form-control">
            <option value="">选择城市</option>
        </select>
    </div>
</div>
**/
(function ($, window, undefined) {
    function Dsy() {
        this.Items = {};
    }
    Dsy.prototype.add = function (id, iArray) {
        this.Items[id] = iArray;
    };
    Dsy.prototype.Exists = function (id) {
        return (typeof(this.Items[id]) == 'undefined') ? false : true;
    };
    var select = ['field_state', 'field_province', 'field_city'];
    function changeRegion(val) {
        var opt0 = ['选择国家', '选择省份', '选择城市'];

        var str = '0';
        for (var i = 0; i < val; i++) {
            str += ('_' + (document.getElementById(select[i]).selectedIndex - 1));
        }
        var ss = document.getElementById(select[val]);
        if (ss == null) {
            return;
        }
        with (ss) {
            length = 0;
            options[0] = new Option(opt0[val], '');
            if (val && document.getElementById(select[val - 1]).selectedIndex > 0 || !val) {
                if (dsy.Exists(str)) {
                    var ar = dsy.Items[str];
                    for (i = 0; i < ar.length; i++) {
                        options[length] = new Option(ar[i], ar[i]);
                    }
                }
            }
            if (++val < ss.length) {
                changeRegion(val);
            }
        }
    }
    function updateRegion () {

        var $state = $('#'+select[0]);
        var $province = $('#'+select[1]);
        var $city = $('#'+select[2]);

        var proState = $state.data('default') || '';
        var proProvince = $province.data('default') || '';
        var proCity = $city.data('default') || '';
        var proCountryCount = $state.find('option').length;
        for (var i = 0; i < proCountryCount; i++) {
            if ($state.get(0).options[i].text == proState) {
                //设置当前国家为选中
                $state.get(0).options[i].selected = true;
                //开始加载省份
                changeRegion(1);
                var proProvinceCount = $province.find('option').length;
                for (var j = 0; j < proProvinceCount; j++) {
                    if ($province.get(0).options[j].text == proProvince) {
                        //设置省份
                        $province.get(0).options[j].selected = true;
                        changeRegion(2);
                        var proCityCount = $city.find('option').length;

                        for (var k = 0; k < proCityCount; k++) {
                            if ($city.get(0).options[k].text == proCity) {
                                //设置城市
                                $city.get(0).options[k].selected = true;
                                break;
                            }
                        }
                        break;
                    }
                }
                break;
            }
        }
    }
    $('select[data-role="region"]').on('change', function () {
        var $this = $(this);
        var name = $this.prop('name').replace('field_', '');
        switch (name) {
            case 'state':
                changeRegion(1);
                break;
            case 'province':
                changeRegion(2);
                break;
            case 'city':
                changeRegion(3);
                break;
        }
    });
    var dsy = new Dsy();

    dsy.add("0", ["中国", "韩国", "日本", "新加坡", "马来西亚", "菲律宾", "沙特阿拉伯", "朝鲜", "越南", "缅甸", "德国", "英国", "法国", "爱尔兰", "波兰", "西班牙", "意大利", "俄罗斯", "荷兰", "美国", "加拿大", "巴西", "阿根廷", "新西兰", "澳大利亚", "印度", "埃及", "智利"]);


    dsy.add("0_0", ["北京", "天津", "河北", "山西", "内蒙古", "辽宁", "吉林", "黑龙江", "上海", "江苏", "浙江", "安徽", "福建", "江西", "山东", "河南", "湖北", "湖南", "广东", "广西", "海南", "重庆", "四川", "贵州", "云南", "西藏", "陕西", "甘肃", "青海", "宁夏", "新疆", "香港", "澳门", "台湾"]);
    dsy.add("0_0_0", ["北京市"]);
    dsy.add("0_0_1", ["天津市"]);
    dsy.add("0_0_2", ["石家庄市", "唐山市", "秦皇岛市", "邯郸市", "邢台市", "保定市", "张家口市", "承德市", "沧州市", "廊坊市", "衡水市"]);
    dsy.add("0_0_3", ["太原市", "大同市", "阳泉市", "长治市", "晋城市", "朔州市", "晋中市", "运城市", "忻州市", "临汾市", "吕梁市"]);
    dsy.add("0_0_4", ["呼和浩特市", "包头市", "乌海市", "赤峰市", "通辽市", "鄂尔多斯市", "呼伦贝尔市", "巴彦淖尔市", "乌兰察布市", "兴安盟", "锡林郭勒盟", "阿拉善盟"]);
    dsy.add("0_0_5", ["沈阳市", "大连市", "鞍山市", "抚顺市", "本溪市", "丹东市", "锦州市", "营口市", "阜新市", "辽阳市", "盘锦市", "铁岭市", "朝阳市", "葫芦岛市"]);
    dsy.add("0_0_6", ["长春市", "吉林市", "四平市", "辽源市", "通化市", "白山市", "松原市", "白城市", "延边朝鲜族自治州"]);
    dsy.add("0_0_7", ["哈尔滨市", "齐齐哈尔市", "鸡西市", "鹤岗市", "双鸭山市", "大庆市", "伊春市", "佳木斯市", "七台河市", "牡丹江市", "黑河市", "绥化市", "大兴安岭地区"]);
    dsy.add("0_0_8", ["上海市"]);
    dsy.add("0_0_9", ["南京市", "无锡市", "徐州市", "常州市", "苏州市", "南通市", "连云港市", "淮安市", "盐城市", "扬州市", "镇江市", "泰州市", "宿迁市"]);
    dsy.add("0_0_10", ["杭州市", "宁波市", "温州市", "嘉兴市", "湖州市", "绍兴市", "金华市", "衢州市", "舟山市", "台州市", "丽水市"]);
    dsy.add("0_0_11", ["合肥市", "芜湖市", "蚌埠市", "淮南市", "马鞍山市", "淮北市", "铜陵市", "安庆市", "黄山市", "滁州市", "阜阳市", "宿州市", "巢湖市", "六安市", "亳州市", "池州市", "宣城市"]);
    dsy.add("0_0_12", ["福州市", "厦门市", "莆田市", "三明市", "泉州市", "漳州市", "南平市", "龙岩市", "宁德市"]);
    dsy.add("0_0_13", ["南昌市", "景德镇市", "萍乡市", "九江市", "新余市", "鹰潭市", "赣州市", "吉安市", "宜春市", "抚州市", "上饶市"]);
    dsy.add("0_0_14", ["济南市", "青岛市", "淄博市", "枣庄市", "东营市", "烟台市", "潍坊市", "济宁市", "泰安市", "威海市", "日照市", "莱芜市", "临沂市", "德州市", "聊城市", "滨州市", "菏泽市"]);
    dsy.add("0_0_15", ["郑州市", "开封市", "洛阳市", "平顶山市", "安阳市", "鹤壁市", "新乡市", "焦作市", "濮阳市", "许昌市", "漯河市", "三门峡市", "南阳市", "商丘市", "信阳市", "周口市", "驻马店市", "济源市"]);
    dsy.add("0_0_16", ["武汉市", "黄石市", "十堰市", "宜昌市", "襄樊市", "鄂州市", "荆门市", "孝感市", "荆州市", "黄冈市", "咸宁市", "随州市", "恩施土家族苗族自治州", "省直辖县级行政单位"]);
    dsy.add("0_0_17", ["长沙市", "株洲市", "湘潭市", "衡阳市", "邵阳市", "岳阳市", "常德市", "张家界市", "益阳市", "郴州市", "永州市", "怀化市", "娄底市", "湘西土家族苗族自治州"]);
    dsy.add("0_0_18", ["广州市", "韶关市", "深圳市", "珠海市", "汕头市", "佛山市", "江门市", "湛江市", "茂名市", "肇庆市", "惠州市", "梅州市", "汕尾市", "河源市", "阳江市", "清远市", "东莞市", "中山市", "潮州市", "揭阳市", "云浮市"]);
    dsy.add("0_0_19", ["南宁市", "柳州市", "桂林市", "梧州市", "北海市", "防城港市", "钦州市", "贵港市", "玉林市", "百色市", "贺州市", "河池市", "来宾市", "崇左市"]);
    dsy.add("0_0_20", ["海口市", "三亚市", "省直辖县级行政单位"]);
    dsy.add("0_0_21", ["重庆市"]);
    dsy.add("0_0_22", ["成都市", "自贡市", "攀枝花市", "泸州市", "德阳市", "绵阳市", "广元市", "遂宁市", "内江市", "乐山市", "南充市", "眉山市", "宜宾市", "广安市", "达州市", "雅安市", "巴中市", "资阳市", "阿坝藏族羌族自治州", "甘孜藏族自治州", "凉山彝族自治州"]);
    dsy.add("0_0_23", ["贵阳市", "六盘水市", "遵义市", "安顺市", "铜仁地区", "黔西南布依族苗族自治州", "毕节地区", "黔东南苗族侗族自治州", "黔南布依族苗族自治州"]);
    dsy.add("0_0_24", ["昆明市", "曲靖市", "玉溪市", "保山市", "昭通市", "丽江市", "普洱市", "临沧市", "楚雄彝族自治州", "红河哈尼族彝族自治州", "文山壮族苗族自治州", "西双版纳傣族自治州", "大理白族自治州", "德宏傣族景颇族自治州", "怒江傈僳族自治州", "迪庆藏族自治州"]);
    dsy.add("0_0_25", ["拉萨市", "昌都地区", "山南地区", "日喀则地区", "那曲地区", "阿里地区", "林芝地区"]);
    dsy.add("0_0_26", ["西安市", "铜川市", "宝鸡市", "咸阳市", "渭南市", "延安市", "汉中市", "榆林市", "安康市", "商洛市"]);
    dsy.add("0_0_27", ["兰州市", "嘉峪关市", "金昌市", "白银市", "天水市", "武威市", "张掖市", "平凉市", "酒泉市", "庆阳市", "定西市", "陇南市", "临夏回族自治州", "甘南藏族自治州"]);
    dsy.add("0_0_28", ["西宁市", "海东地区", "海北藏族自治州", "黄南藏族自治州", "海南藏族自治州", "果洛藏族自治州", "玉树藏族自治州", "海西蒙古族藏族自治州"]);
    dsy.add("0_0_29", ["银川市", "石嘴山市", "吴忠市", "固原市", "中卫市"]);
    dsy.add("0_0_30", ["乌鲁木齐市", "克拉玛依市", "吐鲁番地区", "哈密地区", "昌吉回族自治州", "博尔塔拉蒙古自治州", "巴音郭楞蒙古自治州", "阿克苏地区", "克孜勒苏柯尔克孜自治州", "喀什地区", "和田地区", "伊犁哈萨克自治州", "塔城地区", "阿勒泰地区", "省直辖县级行政单位"]);
    dsy.add("0_0_31", ["香港"]);
    dsy.add("0_0_32", ["澳门"]);
    dsy.add("0_0_33", ["台湾"]);

    dsy.add("0_0_0_0", ["东城区", "西城区", "崇文区", "宣武区", "朝阳区", "丰台区", "石景山区", "海淀区", "门头沟区", "房山区", "通州区", "顺义区", "昌平区", "大兴区", "怀柔区", "平谷区", "密云县", "延庆县"]);
    dsy.add("0_0_1_0", ["和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "塘沽区", "汉沽区", "大港区", "东丽区", "西青区", "津南区", "北辰区", "武清区", "宝坻区", "宁河县", "静海县", "蓟县", "保税区", "经济技术开发区", "高新区", "滨海新区"]);
    dsy.add("0_0_2_0", ["长安区", "桥东区", "桥西区", "新华区", "井陉矿区", "裕华区", "井陉县", "正定县", "栾城县", "行唐县", "灵寿县", "高邑县", "深泽县", "赞皇县", "无极县", "平山县", "元氏县", "赵县", "辛集市", "藁城市", "晋州市", "新乐市", "鹿泉市", "高新技术开发区"]);
    dsy.add("0_0_2_1", ["路南区", "路北区", "古冶区", "开平区", "丰南区", "丰润区", "滦县", "滦南县", "乐亭县", "迁西县", "玉田县", "唐海县", "遵化市", "迁安市", "高新区", "汉沽管理区", "海港开发区", "芦台开发区", "南堡开发区", "曹妃甸工业区"]);
    dsy.add("0_0_2_2", ["海港区", "山海关区", "北戴河区", "青龙满族自治县", "昌黎县", "抚宁县", "卢龙县", "经济技术开发区"]);
    dsy.add("0_0_2_3", ["邯山区", "丛台区", "复兴区", "峰峰矿区", "邯郸县", "临漳县", "成安县", "大名县", "涉县", "磁县", "肥乡县", "永年县", "邱县", "鸡泽县", "广平县", "馆陶县", "魏县", "曲周县", "武安市", "经济开发区"]);
    dsy.add("0_0_2_4", ["桥东区", "桥西区", "邢台县", "临城县", "内丘县", "柏乡县", "隆尧县", "任县", "南和县", "宁晋县", "巨鹿县", "新河县", "广宗县", "平乡县", "威县", "清河县", "临西县", "南宫市", "沙河市"]);
    dsy.add("0_0_2_5", ["新市区", "南市区", "北市区", "满城县", "清苑县", "涞水县", "阜平县", "徐水县", "定兴县", "唐县", "高阳县", "容城县", "涞源县", "望都县", "安新县", "易县", "曲阳县", "蠡县", "顺平县", "博野县", "雄县", "涿州市", "定州市", "安国市", "高碑店市"]);
    dsy.add("0_0_2_6", ["桥东区", "桥西区", "宣化区", "下花园区", "宣化县", "张北县", "康保县", "沽源县", "尚义县", "蔚县", "阳原县", "怀安县", "万全县", "怀来县", "涿鹿县", "赤城县", "崇礼县"]);
    dsy.add("0_0_2_7", ["双桥区", "双滦区", "鹰手营子矿区", "承德县", "兴隆县", "平泉县", "滦平县", "隆化县", "丰宁满族自治县", "宽城满族自治县", "围场满族蒙古族自治县"]);
    dsy.add("0_0_2_8", ["新华区", "运河区", "沧县", "青县", "东光县", "海兴县", "盐山县", "肃宁县", "南皮县", "吴桥县", "献县", "孟村回族自治县", "泊头市", "任丘市", "黄骅市", "河间市"]);
    dsy.add("0_0_2_9", ["安次区", "广阳区", "固安县", "永清县", "香河县", "大城县", "文安县", "大厂回族自治县", "霸州市", "三河市", "开发区"]);
    dsy.add("0_0_2_10", ["桃城区", "枣强县", "武邑县", "武强县", "饶阳县", "安平县", "故城县", "景县", "阜城县", "冀州市", "深州市"]);
    dsy.add("0_0_3_0", ["小店区", "迎泽区", "杏花岭区", "尖草坪区", "万柏林区", "晋源区", "清徐县", "阳曲县", "娄烦县", "古交市"]);
    dsy.add("0_0_3_1", ["城区", "矿区", "南郊区", "新荣区", "阳高县", "天镇县", "广灵县", "灵丘县", "浑源县", "左云县", "大同县"]);
    dsy.add("0_0_3_2", ["城区", "矿区", "郊区", "平定县", "盂县"]);
    dsy.add("0_0_3_3", ["城区", "郊区", "长治县", "襄垣县", "屯留县", "平顺县", "黎城县", "壶关县", "长子县", "武乡县", "沁县", "沁源县", "潞城市"]);
    dsy.add("0_0_3_4", ["城区", "沁水县", "阳城县", "陵川县", "泽州县", "高平市"]);
    dsy.add("0_0_3_5", ["朔城区", "平鲁区", "山阴县", "应县", "右玉县", "怀仁县"]);
    dsy.add("0_0_3_6", ["榆次区", "榆社县", "左权县", "和顺县", "昔阳县", "寿阳县", "太谷县", "祁县", "平遥县", "灵石县", "介休市"]);
    dsy.add("0_0_3_7", ["盐湖区", "临猗县", "万荣县", "闻喜县", "稷山县", "新绛县", "绛县", "垣曲县", "夏县", "平陆县", "芮城县", "永济市", "河津市"]);
    dsy.add("0_0_3_8", ["忻府区", "定襄县", "五台县", "代县", "繁峙县", "宁武县", "静乐县", "神池县", "五寨县", "岢岚县", "河曲县", "保德县", "偏关县", "原平市"]);
    dsy.add("0_0_3_9", ["尧都区", "曲沃县", "翼城县", "襄汾县", "洪洞县", "古县", "安泽县", "浮山县", "吉县", "乡宁县", "大宁县", "隰县", "永和县", "蒲县", "汾西县", "侯马市", "霍州市"]);
    dsy.add("0_0_3_10", ["离石区", "文水县", "交城县", "兴县", "临县", "柳林县", "石楼县", "岚县", "方山县", "中阳县", "交口县", "孝义市", "汾阳市"]);
    dsy.add("0_0_4_0", ["回民区", "玉泉区", "新城区", "赛罕区", "土默特左旗", "托克托县", "和林格尔县", "清水河县", "武川县"]);
    dsy.add("0_0_4_1", ["东河区", "昆都仑区", "青山区", "石拐区", "白云矿区", "九原区", "土默特右旗", "固阳县", "达尔罕茂明安联合旗"]);
    dsy.add("0_0_4_2", ["海勃湾区", "海南区", "乌达区"]);
    dsy.add("0_0_4_3", ["红山区", "元宝山区", "松山区", "阿鲁科尔沁旗", "巴林左旗", "巴林右旗", "林西县", "克什克腾旗", "翁牛特旗", "喀喇沁旗", "宁城县", "敖汉旗", "新城区"]);
    dsy.add("0_0_4_4", ["科尔沁区", "科尔沁左翼中旗", "科尔沁左翼后旗", "开鲁县", "库伦旗", "奈曼旗", "扎鲁特旗", "霍林郭勒市"]);
    dsy.add("0_0_4_5", ["东胜区", "达拉特旗", "准格尔旗", "鄂托克前旗", "鄂托克旗", "杭锦旗", "乌审旗", "伊金霍洛旗"]);
    dsy.add("0_0_4_6", ["海拉尔区", "阿荣旗", "莫力达瓦达斡尔族自治旗", "鄂伦春自治旗", "鄂温克族自治旗", "陈巴尔虎旗", "新巴尔虎左旗", "新巴尔虎右旗", "满洲里市", "牙克石市", "扎兰屯市", "额尔古纳市", "根河市"]);
    dsy.add("0_0_4_7", ["临河区", "五原县", "磴口县", "乌拉特前旗", "乌拉特中旗", "乌拉特后旗", "杭锦后旗"]);
    dsy.add("0_0_4_8", ["集宁区", "卓资县", "化德县", "商都县", "兴和县", "凉城县", "察哈尔右翼前旗", "察哈尔右翼中旗", "察哈尔右翼后旗", "四子王旗", "丰镇市"]);
    dsy.add("0_0_4_9", ["乌兰浩特市", "阿尔山市", "科尔沁右翼前旗", "科尔沁右翼中旗", "扎赉特旗", "突泉县"]);
    dsy.add("0_0_4_10", ["二连浩特市", "锡林浩特市", "阿巴嘎旗", "苏尼特左旗", "苏尼特右旗", "东乌珠穆沁旗", "西乌珠穆沁旗", "太仆寺旗", "镶黄旗", "正镶白旗", "正蓝旗", "多伦县"]);
    dsy.add("0_0_4_11", ["阿拉善左旗", "阿拉善右旗", "额济纳旗"]);
    dsy.add("0_0_5_0", ["和平区", "沈河区", "大东区", "皇姑区", "铁西区", "苏家屯区", "东陵区", "沈北新区", "于洪区", "辽中县", "康平县", "法库县", "新民市", "经济技术开发区", "浑南新区", "新城子经济技术开发区"]);
    dsy.add("0_0_5_1", ["中山区", "西岗区", "沙河口区", "甘井子区", "旅顺口区", "金州区", "长海县", "瓦房店市", "普兰店市", "庄河市", "开发区", "保税区"]);
    dsy.add("0_0_5_2", ["铁东区", "铁西区", "立山区", "千山区", "台安县", "岫岩满族自治县", "海城市"]);
    dsy.add("0_0_5_3", ["新抚区", "东洲区", "望花区", "顺城区", "抚顺县", "新宾满族自治县", "清原满族自治县"]);
    dsy.add("0_0_5_4", ["平山区", "明山区", "溪湖区", "南芬区", "本溪满族自治县", "桓仁满族自治县"]);
    dsy.add("0_0_5_5", ["元宝区", "振兴区", "振安区", "宽甸满族自治县", "东港市", "凤城市"]);
    dsy.add("0_0_5_6", ["古塔区", "凌河区", "太和区", "黑山县", "义县", "凌海市", "北宁市", "松山新区", "经济技术开发区"]);
    dsy.add("0_0_5_7", ["站前区", "西市区", "鲅鱼圈区", "老边区", "盖州市", "大石桥市"]);
    dsy.add("0_0_5_8", ["海州区", "新邱区", "太平区", "清河门区", "细河区", "阜新蒙古族自治县", "彰武县"]);
    dsy.add("0_0_5_9", ["白塔区", "文圣区", "宏伟区", "弓长岭区", "太子河区", "辽阳县", "灯塔市"]);
    dsy.add("0_0_5_10", ["双台子区", "兴隆台区", "大洼县", "盘山县"]);
    dsy.add("0_0_5_11", ["银州区", "清河区", "铁岭县", "西丰县", "昌图县", "调兵山市", "开原市"]);
    dsy.add("0_0_5_12", ["双塔区", "龙城区", "朝阳县", "建平县", "喀喇沁左翼蒙古族自治县", "北票市", "凌源市"]);
    dsy.add("0_0_5_13", ["连山区", "龙港区", "南票区", "绥中县", "建昌县", "兴城市"]);
    dsy.add("0_0_6_0", ["南关区", "宽城区", "朝阳区", "二道区", "绿园区", "双阳区", "农安县", "九台市", "榆树市", "德惠市", "净月经济开发区", "高新技术产业开发区", "经济技术开发区"]);
    dsy.add("0_0_6_1", ["昌邑区", "龙潭区", "船营区", "丰满区", "永吉县", "蛟河市", "桦甸市", "舒兰市", "磐石市"], ["铁西区", "铁东区", "梨树县", "伊通满族自治县", "公主岭市", "双辽市"]);
    dsy.add("0_0_6_2", ["龙山区", "西安区", "东丰县", "东辽县"]);
    dsy.add("0_0_6_3", ["东昌区", "二道江区", "通化县", "辉南县", "柳河县", "梅河口市", "集安市"]);
    dsy.add("0_0_6_4", ["八道江区", "抚松县", "靖宇县", "长白朝鲜族自治县", "江源县", "临江市"]);
    dsy.add("0_0_6_5", ["宁江区", "前郭尔罗斯蒙古族自治县", "长岭县", "乾安县", "扶余县"]);
    dsy.add("0_0_6_6", ["洮北区", "镇赉县", "通榆县", "洮南市", "大安市"]);
    dsy.add("0_0_6_7", ["延吉市", "图们市", "敦化市", "珲春市", "龙井市", "和龙市", "汪清县", "安图县"]);
    dsy.add("0_0_7_0", ["道里区", "南岗区", "道外区", "香坊区", "动力区", "平房区", "松北区", "呼兰区", "依兰县", "方正县", "宾县", "巴彦县", "木兰县", "通河县", "延寿县", "阿城市", "双城市", "尚志市", "五常市"]);
    dsy.add("0_0_7_0", ["龙沙区", "建华区", "铁锋区", "昂昂溪区", "富拉尔基区", "碾子山区", "梅里斯达斡尔族区", "龙江县", "依安县", "泰来县", "甘南县", "富裕县", "克山县", "克东县", "拜泉县", "讷河市"]);
    dsy.add("0_0_7_1", ["鸡冠区", "恒山区", "滴道区", "梨树区", "城子河区", "麻山区", "鸡东县", "虎林市", "密山市"]);
    dsy.add("0_0_7_2", ["向阳区", "工农区", "南山区", "兴安区", "东山区", "兴山区", "萝北县", "绥滨县"]);
    dsy.add("0_0_7_3", ["尖山区", "岭东区", "四方台区", "宝山区", "集贤县", "友谊县", "宝清县", "饶河县"]);
    dsy.add("0_0_7_4", ["萨尔图区", "龙凤区", "让胡路区", "红岗区", "大同区", "肇州县", "肇源县", "林甸县", "杜尔伯特蒙古族自治县"]);
    dsy.add("0_0_7_5", ["伊春区", "南岔区", "友好区", "西林区", "翠峦区", "新青区", "美溪区", "金山屯区", "五营区", "乌马河区", "汤旺河区", "带岭区", "乌伊岭区", "红星区", "上甘岭区", "嘉荫县", "铁力市"]);
    dsy.add("0_0_7_6", ["向阳区", "前进区", "东风区", "郊区", "桦南县", "桦川县", "汤原县", "抚远县", "同江市", "富锦市"]);
    dsy.add("0_0_7_7", ["新兴区", "桃山区", "茄子河区", "勃利县"]);
    dsy.add("0_0_7_8", ["东安区", "爱民区", "阳明区", "西安区", "东宁县", "林口县", "绥芬河市", "海林市", "宁安市", "穆棱市"]);
    dsy.add("0_0_7_9", ["爱辉区", "嫩江县", "逊克县", "孙吴县", "北安市", "五大连池市"]);
    dsy.add("0_0_7_10", ["北林区", "望奎县", "兰西县", "青冈县", "庆安县", "明水县", "绥棱县", "安达市", "肇东市", "海伦市"]);
    dsy.add("0_0_7_11", ["呼玛县", "塔河县", "漠河县", "加格达奇区", "松岭区", "新林区", "呼中区"]);
    dsy.add("0_0_8_0", ["黄浦区", "卢湾区", "徐汇区", "长宁区", "静安区", "普陀区", "闸北区", "虹口区", "杨浦区", "闵行区", "宝山区", "嘉定区", "浦东新区", "金山区", "松江区", "青浦区", "南汇区", "奉贤区", "崇明县"]);
    dsy.add("0_0_9_0", ["玄武区", "白下区", "秦淮区", "建邺区", "鼓楼区", "下关区", "浦口区", "栖霞区", "雨花台区", "江宁区", "六合区", "溧水县", "高淳县"]);
    dsy.add("0_0_9_1", ["崇安区", "南长区", "北塘区", "锡山区", "惠山区", "滨湖区", "江阴市", "宜兴市", "新区"]);
    dsy.add("0_0_9_2", ["云龙区", "鼓楼区", "九里区", "泉山区", "铜山县", "贾汪区", "丰县", "沛县", "睢宁县", "新沂市", "邳州市"]);
    dsy.add("0_0_9_3", ["天宁区", "钟楼区", "戚墅堰区", "新北区", "武进区", "溧阳市", "金坛市"]);
    dsy.add("0_0_9_4", ["沧浪区", "平江区", "金阊区", "虎丘区", "吴中区", "相城区", "常熟市", "张家港市", "昆山市", "吴江市", "太仓市", "工业园区", "高新区"]);
    dsy.add("0_0_9_5", ["崇川区", "港闸区", "海安县", "如东县", "启东市", "如皋市", "通州市", "海门市", "经济技术开发区"], ["连云区", "新浦区", "海州区", "赣榆县", "东海县", "灌云县", "灌南县"]);
    dsy.add("0_0_9_6", ["清河区", "楚州区", "淮阴区", "清浦区", "涟水县", "洪泽县", "盱眙县", "金湖县"], ["亭湖区", "盐都区", "响水县", "滨海县", "阜宁县", "射阳县", "建湖县", "东台市", "大丰市"]);
    dsy.add("0_0_9_7", ["广陵区", "邗江区", "宝应县", "仪征市", "高邮市", "江都市", "维扬区", "经济开发区"], ["京口区", "润州区", "丹徒区", "丹阳市", "扬中市", "句容市", "新区"]);
    dsy.add("0_0_9_8", ["海陵区", "高港区", "兴化市", "靖江市", "泰兴市", "姜堰市"], ["宿城区", "宿豫区", "沭阳县", "泗阳县", "泗洪县"]);
    dsy.add("0_0_10_0", ["上城区", "下城区", "江干区", "拱墅区", "西湖区", "滨江区", "萧山区", "余杭区", "桐庐县", "淳安县", "建德市", "富阳市", "临安市"]);
    dsy.add("0_0_10_1", ["海曙区", "江东区", "江北区", "北仑区", "镇海区", "鄞州区", "象山县", "宁海县", "余姚市", "慈溪市", "奉化市"]);
    dsy.add("0_0_10_2", ["鹿城区", "龙湾区", "瓯海区", "洞头县", "永嘉县", "平阳县", "苍南县", "文成县", "泰顺县", "瑞安市", "乐清市"]);
    dsy.add("0_0_10_3", ["秀洲区", "嘉善县", "海盐县", "海宁市", "平湖市", "桐乡市", "南湖区"]);
    dsy.add("0_0_10_4", ["吴兴区", "南浔区", "德清县", "长兴县", "安吉县"]);
    dsy.add("0_0_10_5", ["越城区", "绍兴县", "新昌县", "诸暨市", "上虞市", "嵊州市"]);
    dsy.add("0_0_10_6", ["婺城区", "金东区", "武义县", "浦江县", "磐安县", "兰溪市", "义乌市", "东阳市", "永康市"]);
    dsy.add("0_0_10_7", ["柯城区", "衢江区", "常山县", "开化县", "龙游县", "江山市"]);
    dsy.add("0_0_10_8", ["定海区", "普陀区", "岱山县", "嵊泗县"]);
    dsy.add("0_0_10_9", ["椒江区", "路桥区", "黄岩区", "玉环县", "三门县", "天台县", "仙居县", "温岭市", "临海市"]);
    dsy.add("0_0_10_10", ["莲都区", "青田县", "缙云县", "遂昌县", "松阳县", "云和县", "庆元县", "景宁畲族自治县", "龙泉市"]);
    dsy.add("0_0_11_0", ["瑶海区", "庐阳区", "蜀山区", "包河区", "长丰县", "肥东县", "肥西县", "经济技术开发区", "新站试验区", "政务文化新区", "高新技术产业开发区"]);
    dsy.add("0_0_11_1", ["镜湖区", "鸠江区", "芜湖县", "繁昌县", "南陵县", "弋江区", "三山区"]);
    dsy.add("0_0_11_2", ["龙子湖区", "蚌山区", "禹会区", "淮上区", "怀远县", "五河县", "固镇县"]);
    dsy.add("0_0_11_3", ["大通区", "田家庵区", "谢家集区", "八公山区", "潘集区", "凤台县"]);
    dsy.add("0_0_11_4", ["雨山区", "花山区", "金家庄区", "当涂县", "经济技术开发区"]);
    dsy.add("0_0_11_5", ["杜集区", "相山区", "烈山区", "濉溪县"]);
    dsy.add("0_0_11_6", ["铜官山区", "狮子山区", "郊区", "铜陵县"]);
    dsy.add("0_0_11_7", ["迎江区", "大观区", "怀宁县", "枞阳县", "潜山县", "太湖县", "宿松县", "望江县", "岳西县", "桐城市", "宜秀区"]);
    dsy.add("0_0_11_8", ["屯溪区", "黄山区", "徽州区", "歙县", "休宁县", "黟县", "祁门县"]);
    dsy.add("0_0_11_9", ["琅琊区", "南谯区", "来安县", "全椒县", "定远县", "凤阳县", "天长市", "明光市"]);
    dsy.add("0_0_11_10", ["颍州区", "颍东区", "颍泉区", "临泉县", "太和县", "阜南县", "颍上县", "界首市", "经济开发区"]);
    dsy.add("0_0_11_11", ["埇桥区", "砀山县", "萧县", "灵璧县", "泗县"]);
    dsy.add("0_0_11_12", ["居巢区", "庐江县", "无为县", "含山县", "和县"]);
    dsy.add("0_0_11_13", ["金安区", "裕安区", "寿县", "霍邱县", "舒城县", "金寨县", "霍山县"]);
    dsy.add("0_0_11_14", ["谯城区", "涡阳县", "蒙城县", "利辛县"]);
    dsy.add("0_0_11_15", ["贵池区", "东至县", "石台县", "青阳县"]);
    dsy.add("0_0_11_16", ["宣州区", "郎溪县", "广德县", "泾县", "绩溪县", "旌德县", "宁国市"]);
    dsy.add("0_0_12_0", ["鼓楼区", "台江区", "仓山区", "马尾区", "晋安区", "闽侯县", "连江县", "罗源县", "闽清县", "永泰县", "平潭县", "福清市", "长乐市"]);
    dsy.add("0_0_12_1", ["思明区", "海沧区", "湖里区", "集美区", "同安区", "翔安区", "鼓浪屿区", "象屿保税区", "火炬高新区"]);
    dsy.add("0_0_12_2", ["城厢区", "涵江区", "荔城区", "秀屿区", "仙游县"]);
    dsy.add("0_0_12_3", ["梅列区", "三元区", "明溪县", "清流县", "宁化县", "大田县", "尤溪县", "沙县", "将乐县", "泰宁县", "建宁县", "永安市"]);
    dsy.add("0_0_12_4", ["鲤城区", "丰泽区", "洛江区", "泉港区", "惠安县", "安溪县", "永春县", "德化县", "金门县", "石狮市", "晋江市", "南安市", "经济技术开发区"]);
    dsy.add("0_0_12_5", ["芗城区", "龙文区", "云霄县", "漳浦县", "诏安县", "长泰县", "东山县", "南靖县", "平和县", "华安县", "龙海市"]);
    dsy.add("0_0_12_6", ["延平区", "顺昌县", "浦城县", "光泽县", "松溪县", "政和县", "邵武市", "武夷山市", "建瓯市", "建阳市"]);
    dsy.add("0_0_12_7", ["新罗区", "长汀县", "永定县", "上杭县", "武平县", "连城县", "漳平市"]);
    dsy.add("0_0_12_8", ["蕉城区", "霞浦县", "古田县", "屏南县", "寿宁县", "周宁县", "柘荣县", "福安市", "福鼎市"]);
    dsy.add("0_0_13_0", ["东湖区", "西湖区", "青云谱区", "湾里区", "青山湖区", "南昌县", "新建县", "安义县", "进贤县", "经济技术开发区", "红谷滩新区", "高新技术产业开发区", "桑海经济技术开发区", "英雄经济开发区"]);
    dsy.add("0_0_13_1", ["昌江区", "珠山区", "浮梁县", "乐平市"]);
    dsy.add("0_0_13_2", ["安源区", "湘东区", "莲花县", "上栗县", "芦溪县"]);
    dsy.add("0_0_13_3", ["庐山区", "浔阳区", "九江县", "武宁县", "修水县", "永修县", "德安县", "星子县", "都昌县", "湖口县", "彭泽县", "瑞昌市"]);
    dsy.add("0_0_13_4", ["渝水区", "分宜县"]);
    dsy.add("0_0_13_5", ["月湖区", "余江县", "贵溪市"]);
    dsy.add("0_0_13_6", ["章贡区", "赣县", "信丰县", "大余县", "上犹县", "崇义县", "安远县", "龙南县", "定南县", "全南县", "宁都县", "于都县", "兴国县", "会昌县", "寻乌县", "石城县", "瑞金市", "南康市"]);
    dsy.add("0_0_13_7", ["吉州区", "青原区", "吉安县", "吉水县", "峡江县", "新干县", "永丰县", "泰和县", "遂川县", "万安县", "安福县", "永新县", "井冈山市"]);
    dsy.add("0_0_13_8", ["袁州区", "奉新县", "万载县", "上高县", "宜丰县", "靖安县", "铜鼓县", "丰城市", "樟树市", "高安市"]);
    dsy.add("0_0_13_9", ["临川区", "南城县", "黎川县", "南丰县", "崇仁县", "乐安县", "宜黄县", "金溪县", "资溪县", "东乡县", "广昌县"]);
    dsy.add("0_0_13_10", ["信州区", "上饶县", "广丰县", "玉山县", "铅山县", "横峰县", "弋阳县", "余干县", "鄱阳县", "万年县", "婺源县", "德兴市"]);
    dsy.add("0_0_14_0", ["历下区", "市中区", "槐荫区", "天桥区", "历城区", "长清区", "平阴县", "济阳县", "商河县", "章丘市", "高新区", "经济开发区"]);
    dsy.add("0_0_14_1", ["市南区", "市北区", "四方区", "黄岛区", "崂山区", "李沧区", "城阳区", "胶州市", "即墨市", "平度市", "胶南市", "莱西市"]);
    dsy.add("0_0_14_2", ["淄川区", "张店区", "博山区", "临淄区", "周村区", "桓台县", "高青县", "沂源县", "高新区"]);
    dsy.add("0_0_14_3", ["市中区", "薛城区", "峄城区", "台儿庄区", "山亭区", "滕州市"]);
    dsy.add("0_0_14_4", ["东营区", "河口区", "垦利县", "利津县", "广饶县"]);
    dsy.add("0_0_14_5", ["芝罘区", "福山区", "牟平区", "莱山区", "长岛县", "龙口市", "莱阳市", "莱州市", "蓬莱市", "招远市", "栖霞市", "海阳市", "开发区"]);
    dsy.add("0_0_14_6", ["潍城区", "寒亭区", "坊子区", "奎文区", "临朐县", "昌乐县", "青州市", "诸城市", "寿光市", "安丘市", "高密市", "昌邑市", "经济开发区", "滨海经济开发区", "高新技术开发区", "出口加工区"]);
    dsy.add("0_0_14_7", ["市中区", "任城区", "微山县", "鱼台县", "金乡县", "嘉祥县", "汶上县", "泗水县", "梁山县", "曲阜市", "兖州市", "邹城市"]);
    dsy.add("0_0_14_8", ["泰山区", "岱岳区", "宁阳县", "东平县", "新泰市", "肥城市"], ["环翠区", "文登市", "荣成市", "乳山市", "经济技术开发区", "高技术开发区"]);
    dsy.add("0_0_14_9", ["东港区", "岚山区", "五莲县", "莒县"]);
    dsy.add("0_0_14_10", ["莱城区", "钢城区"]);
    dsy.add("0_0_14_11", ["兰山区", "罗庄区", "河东区", "沂南县", "郯城县", "沂水县", "苍山县", "费县", "平邑县", "莒南县", "蒙阴县", "临沭县"]);
    dsy.add("0_0_14_12", ["德城区", "陵县", "宁津县", "庆云县", "临邑县", "齐河县", "平原县", "夏津县", "武城县", "乐陵市", "禹城市"]);
    dsy.add("0_0_14_13", ["东昌府区", "阳谷县", "莘县", "茌平县", "东阿县", "冠县", "高唐县", "临清市"]);
    dsy.add("0_0_14_14", ["滨城区", "惠民县", "阳信县", "无棣县", "沾化县", "博兴县", "邹平县"]);
    dsy.add("0_0_14_15", ["牡丹区", "曹县", "单县", "成武县", "巨野县", "郓城县", "鄄城县", "定陶县", "东明县"]);
    dsy.add("0_0_15_0", ["中原区", "二七区", "管城回族区", "金水区", "上街区", "中牟县", "巩义市", "荥阳市", "新密市", "新郑市", "登封市", "高新技术开发区", "惠济区", "经济技术开发区", "郑东新区", "出口加工区"]);
    dsy.add("0_0_15_1", ["龙亭区", "顺河回族区", "鼓楼区", "杞县", "通许县", "尉氏县", "开封县", "兰考县", "金明区", "禹王台区"]);
    dsy.add("0_0_15_2", ["老城区", "西工区", "瀍河回族区", "涧西区", "吉利区", "洛龙区", "孟津县", "新安县", "栾川县", "嵩县", "汝阳县", "宜阳县", "洛宁县", "伊川县", "偃师市", "高新技术开发区", "经济技术开发区"]);
    dsy.add("0_0_15_3", ["新华区", "卫东区", "石龙区", "湛河区", "宝丰县", "叶县", "鲁山县", "郏县", "舞钢市", "汝州市"]);
    dsy.add("0_0_15_4", ["文峰区", "北关区", "殷都区", "龙安区", "安阳县", "汤阴县", "滑县", "内黄县", "林州市"]);
    dsy.add("0_0_15_5", ["鹤山区", "山城区", "淇滨区", "浚县", "淇县"]);
    dsy.add("0_0_15_6", ["红旗区", "卫滨区", "凤泉区", "牧野区", "新乡县", "获嘉县", "原阳县", "延津县", "封丘县", "长垣县", "卫辉市", "辉县市"]);
    dsy.add("0_0_15_7", ["解放区", "中站区", "马村区", "山阳区", "修武县", "博爱县", "武陟县", "温县", "沁阳市", "孟州市"]);
    dsy.add("0_0_15_8", ["华龙区", "清丰县", "南乐县", "范县", "台前县", "濮阳县"]);
    dsy.add("0_0_15_9", ["魏都区", "许昌县", "鄢陵县", "襄城县", "禹州市", "长葛市"]);
    dsy.add("0_0_15_10", ["源汇区", "郾城区", "召陵区", "舞阳县", "临颍县"]);
    dsy.add("0_0_15_11", ["湖滨区", "渑池县", "陕县", "卢氏县", "义马市", "灵宝市"]);
    dsy.add("0_0_15_12", ["宛城区", "卧龙区", "南召县", "方城县", "西峡县", "镇平县", "内乡县", "淅川县", "社旗县", "唐河县", "新野县", "桐柏县", "邓州市"]);
    dsy.add("0_0_15_13", ["梁园区", "睢阳区", "民权县", "睢县", "宁陵县", "柘城县", "虞城县", "夏邑县", "永城市"]);
    dsy.add("0_0_15_14", ["浉河区", "平桥区", "罗山县", "光山县", "新县", "商城县", "固始县", "潢川县", "淮滨县", "息县"]);
    dsy.add("0_0_15_15", ["川汇区", "扶沟县", "西华县", "商水县", "沈丘县", "郸城县", "淮阳县", "太康县", "鹿邑县", "项城市"]);
    dsy.add("0_0_15_16", ["驿城区", "西平县", "上蔡县", "平舆县", "正阳县", "确山县", "泌阳县", "汝南县", "遂平县", "新蔡县"]);
    dsy.add("0_0_15_17", ["济源市"]);
    dsy.add("0_0_16_0", ["江岸区", "江汉区", "硚口区", "汉阳区", "武昌区", "青山区", "洪山区", "东西湖区", "汉南区", "蔡甸区", "江夏区", "黄陂区", "新洲区"]);
    dsy.add("0_0_16_1", ["黄石港区", "西塞山区", "下陆区", "铁山区", "阳新县", "大冶市"]);
    dsy.add("0_0_16_2", ["茅箭区", "张湾区", "郧县", "郧西县", "竹山县", "竹溪县", "房县", "丹江口市"]);
    dsy.add("0_0_16_3", ["西陵区", "伍家岗区", "点军区", "虢亭区", "夷陵区", "远安县", "兴山县", "秭归县", "长阳土家族自治县", "五峰土家族自治县", "宜都市", "当阳市", "枝江市", "经济技术开发区"]);
    dsy.add("0_0_16_4", ["襄城区", "樊城区", "襄阳区", "南漳县", "谷城县", "保康县", "老河口市", "枣阳市", "宜城市"]);
    dsy.add("0_0_16_5", ["梁子湖区", "华容区", "鄂城区"]);
    dsy.add("0_0_16_6", ["东宝区", "掇刀区", "京山县", "沙洋县", "钟祥市"]);
    dsy.add("0_0_16_7", ["孝南区", "孝昌县", "大悟县", "云梦县", "应城市", "安陆市", "汉川市"]);
    dsy.add("0_0_16_8", ["沙市区", "荆州区", "公安县", "监利县", "江陵县", "石首市", "洪湖市", "松滋市"]);
    dsy.add("0_0_16_9", ["黄州区", "团风县", "红安县", "罗田县", "英山县", "浠水县", "蕲春县", "黄梅县", "麻城市", "武穴市"]);
    dsy.add("0_0_16_10", ["咸安区", "嘉鱼县", "通城县", "崇阳县", "通山县", "赤壁市"]);
    dsy.add("0_0_16_11", ["曾都区", "广水市"]);
    dsy.add("0_0_16_12", ["恩施市", "利川市", "建始县", "巴东县", "宣恩县", "咸丰县", "来凤县", "鹤峰县"]);
    dsy.add("0_0_16_13", ["仙桃市", "潜江市", "天门市", "神农架林区"]);
    dsy.add("0_0_17_0", ["芙蓉区", "天心区", "岳麓区", "开福区", "雨花区", "长沙县", "望城县", "宁乡县", "浏阳市"]);
    dsy.add("0_0_17_1", ["荷塘区", "芦淞区", "石峰区", "天元区", "株洲县", "攸县", "茶陵县", "炎陵县", "醴陵市"]);
    dsy.add("0_0_17_2", ["雨湖区", "岳塘区", "湘潭县", "湘乡市", "韶山市"]);
    dsy.add("0_0_17_3", ["珠晖区", "雁峰区", "石鼓区", "蒸湘区", "南岳区", "衡阳县", "衡南县", "衡山县", "衡东县", "祁东县", "耒阳市", "常宁市"]);
    dsy.add("0_0_17_4", ["双清区", "大祥区", "北塔区", "邵东县", "新邵县", "邵阳县", "隆回县", "洞口县", "绥宁县", "新宁县", "城步苗族自治县", "武冈市"]);
    dsy.add("0_0_17_5", ["岳阳楼区", "云溪区", "君山区", "岳阳县", "华容县", "湘阴县", "平江县", "汨罗市", "临湘市"]);
    dsy.add("0_0_17_6", ["武陵区", "鼎城区", "安乡县", "汉寿县", "澧县", "临澧县", "桃源县", "石门县", "津市市"]);
    dsy.add("0_0_17_7", ["永定区", "武陵源区", "慈利县", "桑植县"]);
    dsy.add("0_0_17_8", ["资阳区", "赫山区", "南县", "桃江县", "安化县", "沅江市"]);
    dsy.add("0_0_17_9", ["北湖区", "苏仙区", "桂阳县", "宜章县", "永兴县", "嘉禾县", "临武县", "汝城县", "桂东县", "安仁县", "资兴市"]);
    dsy.add("0_0_17_10", ["冷水滩区", "祁阳县", "东安县", "双牌县", "道县", "江永县", "宁远县", "蓝山县", "新田县", "江华瑶族自治县", "零陵区"]);
    dsy.add("0_0_17_11", ["鹤城区", "中方县", "沅陵县", "辰溪县", "溆浦县", "会同县", "麻阳苗族自治县", "新晃侗族自治县", "芷江侗族自治县", "靖州苗族侗族自治县", "通道侗族自治县", "洪江市"]);
    dsy.add("0_0_17_12", ["娄星区", "双峰县", "新化县", "冷水江市", "涟源市"]);
    dsy.add("0_0_17_13", ["吉首市", "泸溪县", "凤凰县", "花垣县", "保靖县", "古丈县", "永顺县", "龙山县"]);
    dsy.add("0_0_18_0", ["荔湾区", "越秀区", "海珠区", "天河区", "白云区", "黄埔区", "番禺区", "花都区", "增城市", "从化市", "南沙区", "萝岗区"]);
    dsy.add("0_0_18_1", ["武江区", "浈江区", "曲江区", "始兴县", "仁化县", "翁源县", "乳源瑶族自治县", "新丰县", "乐昌市", "南雄市"]);
    dsy.add("0_0_18_2", ["罗湖区", "福田区", "南山区", "宝安区", "龙岗区", "盐田区", "光明新区", "坪山新区"]);
    dsy.add("0_0_18_3", ["香洲区", "斗门区", "金湾区"]);
    dsy.add("0_0_18_4", ["龙湖区", "金平区", "濠江区", "潮阳区", "潮南区", "澄海区", "南澳县"]);
    dsy.add("0_0_18_5", ["禅城区", "南海区", "顺德区", "三水区", "高明区"]);
    dsy.add("0_0_18_6", ["蓬江区", "江海区", "新会区", "台山市", "开平市", "鹤山市", "恩平市"]);
    dsy.add("0_0_18_7", ["赤坎区", "霞山区", "坡头区", "麻章区", "遂溪县", "徐闻县", "廉江市", "雷州市", "吴川市", "开发区"]);
    dsy.add("0_0_18_8", ["茂南区", "茂港区", "电白县", "高州市", "化州市", "信宜市"]);
    dsy.add("0_0_18_9", ["端州区", "鼎湖区", "广宁县", "怀集县", "封开县", "德庆县", "高要市", "四会市", "高新技术产业开发区"]);
    dsy.add("0_0_18_10", ["惠城区", "惠阳区", "博罗县", "惠东县", "龙门县", "大亚湾区", "仲恺高新区"]);
    dsy.add("0_0_18_11", ["梅江区", "梅县", "大埔县", "丰顺县", "五华县", "平远县", "蕉岭县", "兴宁市"]);
    dsy.add("0_0_18_12", ["城区", "陆丰市", "海丰县", "陆河县"]);
    dsy.add("0_0_18_13", ["源城区", "紫金县", "龙川县", "连平县", "和平县", "东源县"]);
    dsy.add("0_0_18_14", ["江城区", "阳西县", "阳东县", "阳春市"]);
    dsy.add("0_0_18_15", ["清城区", "佛冈县", "阳山县", "连山壮族瑶族自治县", "连南瑶族自治县", "清新县", "英德市", "连州市"]);
    dsy.add("0_0_18_16", ["南城区", "石龙镇", "长安镇", "虎门镇", "横沥镇", "寮步镇", "黄江镇", "清溪镇", "莞城区", "万江区", "东城区", "石碣镇", "茶山镇", "石排镇", "企石镇", "桥头镇", "谢岗镇", "东坑镇", "常平镇", "大朗镇", "塘厦镇", "凤岗镇", "厚街镇", "沙田镇", "道滘镇", "洪梅镇", "麻涌镇", "中堂镇", "高埗镇", "樟木头镇", "大岭山镇", "望牛墩镇"]);
    dsy.add("0_0_18_17", ["中山市"]);
    dsy.add("0_0_18_18", ["湘桥区", "潮安县", "饶平县"]);
    dsy.add("0_0_18_19", ["榕城区", "揭东县", "揭西县", "惠来县", "普宁市", "东山区", "普侨区", "大南山侨区"]);
    dsy.add("0_0_18_20", ["云城区", "新兴县", "郁南县", "云安县", "罗定市"]);
    dsy.add("0_0_19_0", ["兴宁区", "青秀区", "江南区", "西乡塘区", "良庆区", "邕宁区", "武鸣县", "隆安县", "马山县", "上林县", "宾阳县", "横县"]);
    dsy.add("0_0_19_0", ["城中区", "鱼峰区", "柳南区", "柳北区", "柳江县", "柳城县", "鹿寨县", "融安县", "融水苗族自治县", "三江侗族自治县"]);
    dsy.add("0_0_19_0", ["秀峰区", "叠彩区", "象山区", "七星区", "雁山区", "阳朔县", "临桂县", "灵川县", "全州县", "兴安县", "永福县", "灌阳县", "龙胜各族自治县", "资源县", "平乐县", "荔浦县", "恭城瑶族自治县"]);
    dsy.add("0_0_19_0", ["万秀区", "蝶山区", "长洲区", "苍梧县", "藤县", "蒙山县", "岑溪市"]);
    dsy.add("0_0_19_1", ["海城区", "银海区", "铁山港区", "合浦县"]);
    dsy.add("0_0_19_2", ["港口区", "防城区", "上思县", "东兴市"]);
    dsy.add("0_0_19_3", ["钦南区", "钦北区", "灵山县", "浦北县", "钦州港经济开发区"]);
    dsy.add("0_0_19_4", ["港北区", "港南区", "覃塘区", "平南县", "桂平市"]);
    dsy.add("0_0_19_5", ["玉州区", "容县", "陆川县", "博白县", "兴业县", "北流市"]);
    dsy.add("0_0_19_6", ["右江区", "田阳县", "田东县", "平果县", "德保县", "靖西县", "那坡县", "凌云县", "乐业县", "田林县", "西林县", "隆林各族自治县"]);
    dsy.add("0_0_19_7", ["八步区", "昭平县", "钟山县", "富川瑶族自治县"]);
    dsy.add("0_0_19_8", ["金城江区", "南丹县", "天峨县", "凤山县", "东兰县", "罗城仫佬族自治县", "环江毛南族自治县", "巴马瑶族自治县", "都安瑶族自治县", "大化瑶族自治县", "宜州市"]);
    dsy.add("0_0_19_9", ["兴宾区", "忻城县", "象州县", "武宣县", "金秀瑶族自治县", "合山市"], ["江洲区", "扶绥县", "宁明县", "龙州县", "大新县", "天等县", "凭祥市"]);
    dsy.add("0_0_20_0", ["秀英区", "龙华区", "琼山区", "美兰区"]);
    dsy.add("0_0_20_1", ["河西区", "河东区", "田独镇", "凤凰镇", "三亚市", "崖城镇", "天涯镇", "育才乡", "海棠湾镇"]);
    dsy.add("0_0_20_2", ["五指山市", "琼海市", "儋州市", "文昌市", "万宁市", "东方市", "定安县", "屯昌县", "澄迈县", "临高县", "白沙黎族自治县", "昌江黎族自治县", "乐东黎族自治县", "陵水黎族自治县", "保亭黎族苗族自治县", "琼中黎族苗族自治县", "西、南、中沙群岛办事处"]);
    dsy.add("0_0_21_0", ["万州区", "涪陵区", "渝中区", "大渡口区", "江北区", "沙坪坝区", "九龙坡区", "南岸区", "北碚区", "万盛区", "双桥区", "渝北区", "巴南区", "黔江区", "长寿区", "綦江县", "潼南县", "铜梁县", "大足县", "荣昌县", "璧山县", "梁平县", "城口县", "丰都县", "垫江县", "武隆县", "忠县", "开县", "云阳县", "奉节县", "巫山县", "巫溪县", "石柱土家族自治县", "秀山土家族苗族自治县", "酉阳土家族苗族自治县", "彭水苗族土家族自治县", "高新区", "江津区", "合川区", "永川区", "南川区"]);
    dsy.add("0_0_22_0", ["锦江区", "青羊区", "金牛区", "武侯区", "成华区", "龙泉驿区", "青白江区", "新都区", "温江区", "金堂县", "双流县", "郫县", "大邑县", "蒲江县", "新津县", "都江堰市", "彭州市", "邛崃市", "崇州市", "高新区", "高新西区"]);
    dsy.add("0_0_22_1", ["自流井区", "贡井区", "大安区", "沿滩区", "荣县", "富顺县"]);
    dsy.add("0_0_22_2", ["东区", "西区", "仁和区", "米易县", "盐边县"]);
    dsy.add("0_0_22_3", ["江阳区", "纳溪区", "龙马潭区", "泸县", "合江县", "叙永县", "古蔺县"]);
    dsy.add("0_0_22_4", ["旌阳区", "中江县", "罗江县", "广汉市", "什邡市", "绵竹市"]);
    dsy.add("0_0_22_5", ["涪城区", "游仙区", "三台县", "盐亭县", "安县", "梓潼县", "北川羌族自治县", "平武县", "江油市", "农科区", "经济技术开发区", "高新区", "仙海区"]);
    dsy.add("0_0_22_6", ["利州区", "元坝区", "朝天区", "旺苍县", "青川县", "剑阁县", "苍溪县"], ["船山区", "安居区", "蓬溪县", "射洪县", "大英县"]);
    dsy.add("0_0_22_7", ["市中区", "东兴区", "威远县", "资中县", "隆昌县"]);
    dsy.add("0_0_22_8", ["市中区", "沙湾区", "五通桥区", "金口河区", "犍为县", "井研县", "夹江县", "沐川县", "峨边彝族自治县", "马边彝族自治县", "峨眉山市"]);
    dsy.add("0_0_22_9", ["顺庆区", "高坪区", "嘉陵区", "南部县", "营山县", "蓬安县", "仪陇县", "西充县", "阆中市"]);
    dsy.add("0_0_22_10", ["东坡区", "仁寿县", "彭山县", "洪雅县", "丹棱县", "青神县"]);
    dsy.add("0_0_22_11", ["翠屏区", "宜宾县", "南溪县", "江安县", "长宁县", "高县", "珙县", "筠连县", "兴文县", "屏山县"]);
    dsy.add("0_0_22_12", ["广安区", "岳池县", "武胜县", "邻水县", "华蓥市"]);
    dsy.add("0_0_22_13", ["通川区", "达县", "宣汉县", "开江县", "大竹县", "渠县", "万源市"]);
    dsy.add("0_0_22_14", ["雨城区", "名山县", "荥经县", "汉源县", "石棉县", "天全县", "芦山县", "宝兴县"]);
    dsy.add("0_0_22_15", ["巴州区", "通江县", "南江县", "平昌县"]);
    dsy.add("0_0_22_16", ["雁江区", "安岳县", "乐至县", "简阳市"]);
    dsy.add("0_0_22_17", ["汶川县", "理县", "茂县", "松潘县", "九寨沟县", "金川县", "小金县", "黑水县", "马尔康县", "壤塘县", "阿坝县", "若尔盖县", "红原县"]);
    dsy.add("0_0_22_18", ["康定县", "泸定县", "丹巴县", "九龙县", "雅江县", "道孚县", "炉霍县", "甘孜县", "新龙县", "德格县", "白玉县", "石渠县", "色达县", "理塘县", "巴塘县", "乡城县", "稻城县", "得荣县"]);
    dsy.add("0_0_22_19", ["西昌市", "木里藏族自治县", "盐源县", "德昌县", "会理县", "会东县", "宁南县", "普格县", "布拖县", "金阳县", "昭觉县", "喜德县", "冕宁县", "越西县", "甘洛县", "美姑县", "雷波县"]);
    dsy.add("0_0_23_0", ["南明区", "云岩区", "花溪区", "乌当区", "白云区", "小河区", "开阳县", "息烽县", "修文县", "清镇市", "金阳新区"]);
    dsy.add("0_0_23_1", ["钟山区", "六枝特区", "水城县", "盘县"]);
    dsy.add("0_0_23_2", ["红花岗区", "汇川区", "遵义县", "桐梓县", "绥阳县", "正安县", "道真仡佬族苗族自治县", "务川仡佬族苗族自治县", "凤冈县", "湄潭县", "余庆县", "习水县", "赤水市", "仁怀市"]);
    dsy.add("0_0_23_3", ["西秀区", "平坝县", "普定县", "镇宁布依族苗族自治县", "关岭布依族苗族自治县", "紫云苗族布依族自治县"]);
    dsy.add("0_0_23_4", ["铜仁市", "江口县", "玉屏侗族自治县", "石阡县", "思南县", "印江土家族苗族自治县", "德江县", "沿河土家族自治县", "松桃苗族自治县", "万山特区"]);
    dsy.add("0_0_23_5", ["兴义市", "兴仁县", "普安县", "晴隆县", "贞丰县", "望谟县", "册亨县", "安龙县"]);
    dsy.add("0_0_23_6", ["毕节市", "大方县", "黔西县", "金沙县", "织金县", "纳雍县", "威宁彝族回族苗族自治县", "赫章县"]);
    dsy.add("0_0_23_7", ["凯里市", "黄平县", "施秉县", "三穗县", "镇远县", "岑巩县", "天柱县", "锦屏县", "剑河县", "台江县", "黎平县", "榕江县", "从江县", "雷山县", "麻江县", "丹寨县"]);
    dsy.add("0_0_23_8", ["都匀市", "福泉市", "荔波县", "贵定县", "瓮安县", "独山县", "平塘县", "罗甸县", "长顺县", "龙里县", "惠水县", "三都水族自治县"]);
    dsy.add("0_0_24_0", ["五华区", "盘龙区", "官渡区", "西山区", "东川区", "呈贡县", "晋宁县", "富民县", "宜良县", "石林彝族自治县", "嵩明县", "禄劝彝族苗族自治县", "寻甸回族彝族自治县", "安宁市"]);
    dsy.add("0_0_24_1", ["麒麟区", "马龙县", "陆良县", "师宗县", "罗平县", "富源县", "会泽县", "沾益县", "宣威市"]);
    dsy.add("0_0_24_2", ["红塔区", "江川县", "澄江县", "通海县", "华宁县", "易门县", "峨山彝族自治县", "新平彝族傣族自治县", "元江哈尼族彝族傣族自治县"]);
    dsy.add("0_0_24_3", ["隆阳区", "施甸县", "腾冲县", "龙陵县", "昌宁县"]);
    dsy.add("0_0_24_4", ["昭阳区", "鲁甸县", "巧家县", "盐津县", "大关县", "永善县", "绥江县", "镇雄县", "彝良县", "威信县", "水富县"]);
    dsy.add("0_0_24_5", ["古城区", "玉龙纳西族自治县", "永胜县", "华坪县", "宁蒗彝族自治县"]);
    dsy.add("0_0_24_6", ["思茅区", "宁洱哈尼族彝族自治县", "墨江哈尼族自治县", "景东彝族自治县", "景谷傣族彝族自治县", "镇沅彝族哈尼族拉祜族自治县", "江城哈尼族彝族自治县", "孟连傣族拉祜族佤族自治县", "澜沧拉祜族自治县", "西盟佤族自治县"]);
    dsy.add("0_0_24_7", ["临翔区", "凤庆县", "云县", "永德县", "镇康县", "双江拉祜族佤族布朗族傣族自治县", "耿马傣族佤族自治县", "沧源佤族自治县"]);
    dsy.add("0_0_24_8", ["楚雄市", "双柏县", "牟定县", "南华县", "姚安县", "大姚县", "永仁县", "元谋县", "武定县", "禄丰县"]);
    dsy.add("0_0_24_9", ["个旧市", "开远市", "蒙自县", "屏边苗族自治县", "建水县", "石屏县", "弥勒县", "泸西县", "元阳县", "红河县", "金平苗族瑶族傣族自治县", "绿春县", "河口瑶族自治县"]);
    dsy.add("0_0_24_10", ["文山县", "砚山县", "西畴县", "麻栗坡县", "马关县", "丘北县", "广南县", "富宁县"]);
    dsy.add("0_0_24_11", ["景洪市", "勐海县", "勐腊县"]);
    dsy.add("0_0_24_12", ["大理市", "漾濞彝族自治县", "祥云县", "宾川县", "弥渡县", "南涧彝族自治县", "巍山彝族回族自治县", "永平县", "云龙县", "洱源县", "剑川县", "鹤庆县"]);
    dsy.add("0_0_24_13", ["瑞丽市", "潞西市", "梁河县", "盈江县", "陇川县"]);
    dsy.add("0_0_24_14", ["泸水县", "福贡县", "贡山独龙族怒族自治县", "兰坪白族普米族自治县"]);
    dsy.add("0_0_24_15", ["香格里拉县", "德钦县", "维西傈僳族自治县"]);
    dsy.add("0_0_25_0", ["城关区", "林周县", "当雄县", "尼木县", "曲水县", "堆龙德庆县", "达孜县", "墨竹工卡县"]);
    dsy.add("0_0_25_1", ["昌都县", "江达县", "贡觉县", "类乌齐县", "丁青县", "察雅县", "八宿县", "左贡县", "芒康县", "洛隆县", "边坝县"]);
    dsy.add("0_0_25_2", ["乃东县", "扎囊县", "贡嘎县", "桑日县", "琼结县", "曲松县", "措美县", "洛扎县", "加查县", "隆子县", "错那县", "浪卡子县"]);
    dsy.add("0_0_25_3", ["日喀则市", "南木林县", "江孜县", "定日县", "萨迦县", "拉孜县", "昂仁县", "谢通门县", "白朗县", "仁布县", "康马县", "定结县", "仲巴县", "亚东县", "吉隆县", "聂拉木县", "萨嘎县", "岗巴县"]);
    dsy.add("0_0_25_4", ["那曲县", "嘉黎县", "比如县", "聂荣县", "安多县", "申扎县", "索县", "班戈县", "巴青县", "尼玛县"]);
    dsy.add("0_0_25_5", ["普兰县", "札达县", "噶尔县", "日土县", "革吉县", "改则县", "措勤县"]);
    dsy.add("0_0_25_6", ["林芝县", "工布江达县", "米林县", "墨脱县", "波密县", "察隅县", "朗县"]);
    dsy.add("0_0_26_0", ["新城区", "碑林区", "莲湖区", "灞桥区", "未央区", "雁塔区", "阎良区", "临潼区", "长安区", "蓝田县", "周至县", "户县", "高陵县", "高新区"]);
    dsy.add("0_0_26_1", ["王益区", "印台区", "耀州区", "宜君县", "新区"]);
    dsy.add("0_0_26_2", ["渭滨区", "金台区", "陈仓区", "凤翔县", "岐山县", "扶风县", "眉县", "陇县", "千阳县", "麟游县", "凤县", "太白县"]);
    dsy.add("0_0_26_3", ["秦都区", "渭城区", "杨陵区", "三原县", "泾阳县", "兴平市", "乾县", "礼泉县", "永寿县", "彬县", "长武县", "旬邑县", "淳化县", "武功县"]);
    dsy.add("0_0_26_4", ["临渭区", "华县", "潼关县", "大荔县", "合阳县", "澄城县", "蒲城县", "白水县", "富平县", "韩城市", "华阴市"]);
    dsy.add("0_0_26_5", ["宝塔区", "延长县", "延川县", "子长县", "安塞县", "志丹县", "吴旗县", "甘泉县", "富县", "洛川县", "宜川县", "黄龙县", "黄陵县"]);
    dsy.add("0_0_26_6", ["汉台区", "南郑县", "城固县", "洋县", "西乡县", "勉县", "宁强县", "略阳县", "镇巴县", "留坝县", "佛坪县", "经济开发区"]);
    dsy.add("0_0_26_7", ["榆阳区", "神木县", "府谷县", "横山县", "靖边县", "定边县", "绥德县", "米脂县", "佳县", "吴堡县", "清涧县", "子洲县"]);
    dsy.add("0_0_26_8", ["汉滨区", "汉阴县", "石泉县", "宁陕县", "紫阳县", "岚皋县", "平利县", "镇坪县", "旬阳县", "白河县"]);
    dsy.add("0_0_26_9", ["商州区", "洛南县", "丹凤县", "商南县", "山阳县", "镇安县", "柞水县"]);
    dsy.add("0_0_27_0", ["城关区", "七里河区", "西固区", "安宁区", "红古区", "永登县", "皋兰县", "榆中县"]);
    dsy.add("0_0_27_1", ["嘉峪关市"]);
    dsy.add("0_0_27_2", ["金川区", "永昌县"]);
    dsy.add("0_0_27_3", ["白银区", "平川区", "靖远县", "会宁县", "景泰县"]);
    dsy.add("0_0_27_4", ["秦州区", "麦积区", "清水县", "秦安县", "甘谷县", "武山县", "张家川回族自治县"]);
    dsy.add("0_0_27_5", ["凉州区", "民勤县", "古浪县", "天祝藏族自治县"]);
    dsy.add("0_0_27_6", ["甘州区", "肃南裕固族自治县", "民乐县", "临泽县", "高台县", "山丹县"]);
    dsy.add("0_0_27_7", ["崆峒区", "泾川县", "灵台县", "崇信县", "华亭县", "庄浪县", "静宁县"]);
    dsy.add("0_0_27_8", ["肃州区", "金塔县", "安西县", "肃北蒙古族自治县", "阿克塞哈萨克族自治县", "玉门市", "敦煌市"]);
    dsy.add("0_0_27_9", ["西峰区", "庆城县", "环县", "华池县", "合水县", "正宁县", "宁县", "镇原县"]);
    dsy.add("0_0_27_10", ["安定区", "通渭县", "陇西县", "渭源县", "临洮县", "漳县", "岷县"]);
    dsy.add("0_0_27_11", ["武都区", "成县", "文县", "宕昌县", "康县", "西和县", "礼县", "徽县", "两当县"]);
    dsy.add("0_0_27_12", ["临夏市", "临夏县", "康乐县", "永靖县", "广河县", "和政县", "东乡族自治县", "积石山保安族东乡族撒拉族自治县"]);
    dsy.add("0_0_27_13", ["合作市", "临潭县", "卓尼县", "舟曲县", "迭部县", "玛曲县", "碌曲县", "夏河县"]);
    dsy.add("0_0_28_0", ["城东区", "城中区", "城西区", "城北区", "大通回族土族自治县", "湟中县", "湟源县"]);
    dsy.add("0_0_28_1", ["平安县", "民和回族土族自治县", "乐都县", "互助土族自治县", "化隆回族自治县", "循化撒拉族自治县"]);
    dsy.add("0_0_28_2", ["门源回族自治县", "祁连县", "海晏县", "刚察县"]);
    dsy.add("0_0_28_3", ["同仁县", "尖扎县", "泽库县", "河南蒙古族自治县"]);
    dsy.add("0_0_28_4", ["共和县", "同德县", "贵德县", "兴海县", "贵南县"]);
    dsy.add("0_0_28_5", ["玛沁县", "班玛县", "甘德县", "达日县", "久治县", "玛多县"]);
    dsy.add("0_0_28_6", ["玉树县", "杂多县", "称多县", "治多县", "囊谦县", "曲麻莱县"]);
    dsy.add("0_0_28_7", ["格尔木市", "德令哈市", "乌兰县", "都兰县", "天峻县", "大柴旦行委"]);
    dsy.add("0_0_29_0", ["兴庆区", "西夏区", "金凤区", "永宁县", "贺兰县", "灵武市"]);
    dsy.add("0_0_29_1", ["大武口区", "惠农区", "平罗县"]);
    dsy.add("0_0_29_2", ["利通区", "盐池县", "同心县", "青铜峡市"]);
    dsy.add("0_0_29_3", ["原州区", "西吉县", "隆德县", "泾源县", "彭阳县"]);
    dsy.add("0_0_29_4", ["沙坡头区", "中宁县", "海原县"]);
    dsy.add("0_0_30_0", ["天山区", "沙依巴克区", "新市区", "水磨沟区", "头屯河区", "达坂城区", "米东区", "乌鲁木齐县"]);
    dsy.add("0_0_30_1", ["独山子区", "克拉玛依区", "白碱滩区", "乌尔禾区"]);
    dsy.add("0_0_30_2", ["吐鲁番市", "鄯善县", "托克逊县"]);
    dsy.add("0_0_30_3", ["哈密市", "巴里坤哈萨克自治县", "伊吾县"]);
    dsy.add("0_0_30_4", ["昌吉市", "阜康市", "米泉市", "呼图壁县", "玛纳斯县", "奇台县", "吉木萨尔县", "木垒哈萨克自治县"]);
    dsy.add("0_0_30_5", ["博乐市", "精河县", "温泉县"]);
    dsy.add("0_0_30_6", ["库尔勒市", "轮台县", "尉犁县", "若羌县", "且末县", "焉耆回族自治县", "和静县", "和硕县", "博湖县"]);
    dsy.add("0_0_30_7", ["阿克苏市", "温宿县", "库车县", "沙雅县", "新和县", "拜城县", "乌什县", "阿瓦提县", "柯坪县"]);
    dsy.add("0_0_30_8", ["阿图什市", "阿克陶县", "阿合奇县", "乌恰县"]);
    dsy.add("0_0_30_9", ["喀什市", "疏附县", "疏勒县", "英吉沙县", "泽普县", "莎车县", "叶城县", "麦盖提县", "岳普湖县", "伽师县", "巴楚县", "塔什库尔干塔吉克自治县"]);
    dsy.add("0_0_30_10", ["和田市", "和田县", "墨玉县", "皮山县", "洛浦县", "策勒县", "于田县", "民丰县"]);
    dsy.add("0_0_30_11", ["伊宁市", "奎屯市", "伊宁县", "察布查尔锡伯自治县", "霍城县", "巩留县", "新源县", "昭苏县", "特克斯县", "尼勒克县"]);
    dsy.add("0_0_30_12", ["塔城市", "乌苏市", "额敏县", "沙湾县", "托里县", "裕民县", "和布克赛尔蒙古自治县"]);
    dsy.add("0_0_30_13", ["阿勒泰市", "布尔津县", "富蕴县", "福海县", "哈巴河县", "青河县", "吉木乃县"]);
    dsy.add("0_0_30_14", ["石河子市", "阿拉尔市", "图木舒克市", "五家渠市"]);
    dsy.add("0_0_31_0", ["香港"]);
    dsy.add("0_0_32_0", ["澳门"]);
    dsy.add("0_0_33_0", ["台湾"]);


    dsy.add("0_1", ["汉城特別市", "釜山广域市", "大邱广域市", "仁川广域市", "光州广域市", "大田广域市", "蔚山广域市", " 京畿道", "江原道", "忠清北道", "忠清南道", "全罗北道", "全罗南道", "庆尚北道", "庆尚南道", "济州道"]);
    dsy.add("0_1_0", ["汉城"]);
    dsy.add("0_1_1", ["釜山", "机张郡"]);
    dsy.add("0_1_2", ["大邱", "达城郡"]);
    dsy.add("0_1_3", ["仁川", "江华郡", "瓮津郡"]);
    dsy.add("0_1_4", ["光州"]);
    dsy.add("0_1_5", ["大田"]);
    dsy.add("0_1_6", ["蔚山", "蔚州郡"]);
    dsy.add("0_1_7", ["水原市", "城南市", "安山市", "高阳市", "安养市", "富川市"]);
    dsy.add("0_1_8", ["春川市", "原州市", "江陵市"]);
    dsy.add("0_1_9", ["清州市"]);
    dsy.add("0_1_10", ["天安市"]);
    dsy.add("0_1_11", ["全州市", "群山市", "益山市"]);
    dsy.add("0_1_12", ["木浦市", "丽水市", "顺天市"]);
    dsy.add("0_1_13", ["浦项市", "龟尾市", "庆州市"]);
    dsy.add("0_1_14", ["昌原市", "马山市", "晋州市"]);
    dsy.add("0_1_15", ["济州市", "西归浦市", "北济州郡", "南济州郡"]);


    dsy.add("0_2", ["东京都", "神奈川县", "大阪府", "爱知县", "北海道", "兵库县", "京都府", "福冈县", "神奈川县", "埼玉县", "广岛县", "宫城县", "福冈县", "千叶县"]);
    dsy.add("0_2_0", ["东京"]);
    dsy.add("0_2_1", ["横滨市"]);
    dsy.add("0_2_2", ["大阪市"]);
    dsy.add("0_2_3", ["名古屋市 "]);
    dsy.add("0_2_4", ["札幌市"]);
    dsy.add("0_2_5", ["神戸市"]);
    dsy.add("0_2_6", ["京都市"]);
    dsy.add("0_2_7", ["福冈市"]);
    dsy.add("0_2_8", ["川崎市"]);
    dsy.add("0_2_9", ["埼玉市"]);
    dsy.add("0_2_10", ["广岛市"]);
    dsy.add("0_2_11", ["仙台市"]);
    dsy.add("0_2_12", ["北九州市 "]);
    dsy.add("0_2_13", ["千叶市"]);


    dsy.add("0_3", ["新加坡"]);
    dsy.add("0_3_0", ["新加坡"]);


    dsy.add("0_4", ["吉打 Kedah", "槟榔屿 Pulau Pinang", "霹雳 Perak", "吉兰丹 Kelantan", "丁加奴 Terengganu", "彭亨 Pahang", "雪兰莪 Selangor", "吉隆坡联邦直辖区 Kuala Lumpur", "布特拉再也联邦直辖区 Putrajaya", "森美兰 Sembilan", "马六甲 Melaka", "柔佛 Johor", "斗湖省 Tawau", "山打根省 Sandakan", "西海岸省 Pantai Barat"]);
    dsy.add("0_4_0", ["亚罗士打 Alor Setar", "浮罗交怡 Langkawi", "古邦巴素 Kubang Pasu", "巴东得腊 Padang Terap", "哥打士打 Kota Setar"]);
    dsy.add("0_4_1", ["槟城 George Town", "北区（北海） Utara (Butterworth)", "中区（大山脚） Tengah (Bkt. Mertajam)", "南区（高渊） Selatan (Nibong Tebal)", "东北 Timur Laut"]);
    dsy.add("0_4_2", ["怡保 Ipoh", "拉律-马当 Larut & Matang", "近打 Kinta", "江沙 Kuala Kangsar"]);
    dsy.add("0_4_3", ["哥打巴鲁 Kota Baharu", "道北 Tumpat", "哥登峇鲁 Kota Bharu", "巴西马 Pasir Mas"]);
    dsy.add("0_4_4", ["瓜拉丁加奴 Kuala Terengganu", "勿述 Besut", "瓜拉丁加奴 Kuala Terengganu", "龙运 Dungun", "甘马挽 Kemaman"]);
    dsy.add("0_4_5", ["关丹 Kuantan", "金马仑高原 Cameron Highlands", "立卑 Lipis", "关丹 Kuantan", "而连突 Jerantut"]);
    dsy.add("0_4_6", ["莎亚南 Shah Alam ", "沙白安南 Sabak Bernam", "乌鲁雪兰莪 Ulu Selangor", "瓜拉雪兰莪 Kuala Selangor"]);
    dsy.add("0_4_7", ["吉隆坡 Kuala Lumpur"]);
    dsy.add("0_4_8", ["布特拉再也 Putrajaya"]);
    dsy.add("0_4_9", ["芙蓉 Seremban", "日叻务 Jelebu", "仁保 Jempol"]);
    dsy.add("0_4_10", ["马六甲 Melaka", "亚罗牙也 Alor Gajah"]);
    dsy.add("0_4_11", ["新山 Johor Baharu", "昔加末 Segamat", "丰盛港 Mersing", "居銮 Keluang"]);
    dsy.add("0_4_12", ["斗湖 Tawau", "拿笃 Lahad Datu"]);
    dsy.add("0_4_13", ["山打根 Sandakan", "京那巴登岸 Kinabatangan"]);
    dsy.add("0_4_14", ["哥打京那峇鲁（亚庇） Kota Kinabalu", "兰脑 Ranau", "古打毛律 Kota Belud", "斗亚兰 Tuaran"]);


    dsy.add("0_5", ["伊罗戈斯 Ilocos", "卡加延河谷 Cagayan", "中央吕宋 Central Luzon", "甲拉巴松 Calabarzon", "比科尔 Bicol", "西米沙鄢 Western Visayas", "中米沙鄢 Central Visayas", "东米沙鄢 Eastern Visayas", "国家首都区 National Capital Region"]);
    dsy.add("0_5_0", ["圣费尔南多* San Fernando"]);
    dsy.add("0_5_1", ["土格加劳 Tuguegarao"]);
    dsy.add("0_5_2", ["圣费尔南多* San Fernando"]);
    dsy.add("0_5_3", ["奎松城 Quezon"]);
    dsy.add("0_5_4", ["黎牙实比 Legaspi"]);
    dsy.add("0_5_5", ["伊洛伊洛 Legaspi"]);
    dsy.add("0_5_6", ["宿务 Cebu"]);
    dsy.add("0_5_7", ["塔克洛班 Tacloban"]);
    dsy.add("0_5_8", ["马尼拉 Manila"]);


    dsy.add("0_6", ["利雅得 Ar Riyad", "麦加 Makkah", "麦地那 Al Madinah", "东部 Ash Sharqiyah", "卡西姆 Al Qasim", "哈伊勒 Ha'il", "塔布克 Tabuk", "北部边疆 Al Hudud ash Shamaliyah", "吉赞 Jizan", "纳季兰 Najran", "巴哈 Al Bahah", "朱夫 Al Jawf", "阿西尔 'Asir"]);
    dsy.add("0_6_0", ["利雅得 Riyad", "海耶 Al-Kharj"]);
    dsy.add("0_6_1", ["麦加 Makkah", "吉达 Jiddah", "塔伊夫 At-Ta'if"]);
    dsy.add("0_6_2", ["麦地那 Madinah", "延布 Yanbu' al-Bahr"]);
    dsy.add("0_6_3", ["达曼 Dammam", "胡富夫 Al-Hufūf", "姆巴拉兹 Al-Mubarraz", "朱拜勒 Al-Jubayl", "哈费尔巴廷 Hafar al-Bātin"]);
    dsy.add("0_6_4", ["布赖代 Buraydah"]);
    dsy.add("0_6_5", ["哈伊勒 Ha'il"]);
    dsy.add("0_6_6", ["塔布克 Tabuk"]);
    dsy.add("0_6_7", ["阿尔阿尔 Ar'ar"]);
    dsy.add("0_6_8", ["吉赞 Jizan"]);
    dsy.add("0_6_9", ["纳季兰 Najran"]);
    dsy.add("0_6_10", ["巴哈 Al Bahah"]);
    dsy.add("0_6_11", ["塞卡卡 Sakaka"]);
    dsy.add("0_6_12", ["艾卜哈 Abhā", "海米斯穆谢特 Khamīs Mushayt"]);


    dsy.add("0_7", ["平壤直辖市", "罗先直辖市", "平安南道", "平安北道", "慈江道", "两江道", "咸镜北道", "咸镜南道", "黄海北道", "黄海南道", "江原道"]);
    dsy.add("0_7_0", ["平壤"]);
    dsy.add("0_7_1", ["罗津"]);
    dsy.add("0_7_2", ["南浦特级市", "平城市", "顺川市", "德川市", "安州市", "价川市"]);
    dsy.add("0_7_3", ["新义州市", "龟城市", "定州市"]);
    dsy.add("0_7_4", ["江界市", "满浦市", "煕川市"]);
    dsy.add("0_7_5", ["恵山市"]);
    dsy.add("0_7_6", ["清津市", "金策市", "会宁市"]);
    dsy.add("0_7_7", ["咸兴市", "兴南市", "新浦市", "端川市"]);
    dsy.add("0_7_8", ["沙里院市", "松林市", "开城市"]);
    dsy.add("0_7_9", ["海州市"]);
    dsy.add("0_7_10", ["元山市", "文川市"]);


    dsy.add("0_8", ["河内市", "山罗", "奠边", "谅山", "河西", "清化", "义安", "广南", "嘉莱", "多乐", "平福", "金瓯"]);
    dsy.add("0_8_0", ["河内市"]);
    dsy.add("0_8_1", ["山罗"]);
    dsy.add("0_8_2", ["奠边府市", "孟雷"]);
    dsy.add("0_8_3", ["谅山市"]);
    dsy.add("0_8_4", ["河东", "山西"]);
    dsy.add("0_8_5", ["清化市", "岑山", "拜尚"]);
    dsy.add("0_8_6", ["荣市", "扩路"]);
    dsy.add("0_8_7", ["三歧", "会安"]);
    dsy.add("0_8_8", ["波来古市", "安溪"]);
    dsy.add("0_8_9", ["邦美蜀市"]);
    dsy.add("0_8_10", ["东帅"]);
    dsy.add("0_8_11", ["金瓯市"]);


    dsy.add("0_9", ["实皆省 Sagaing", "望濑县 Monywa", "勃固省 Bago", "马圭省 Magway", "曼德勒省 Mandalay", "德林达依省 Tanintharyi", "伊洛瓦底省 Ayeyarwady", "仰光省 Yangon", "克钦邦 Kachin", "克耶邦 Kayah", "克伦邦 Kayin", "钦邦 Chin", "孟邦 Mon", "若开邦 Rakhine", "掸邦 Shan"]);
    dsy.add("0_9_0", ["实皆 Sagaing"]);
    dsy.add("0_9_1", ["望濑 Monywa"]);
    dsy.add("0_9_2", ["勃固 Bago"]);
    dsy.add("0_9_3", ["马圭 Magway"]);
    dsy.add("0_9_4", ["曼德勒 Mandalay"]);
    dsy.add("0_9_5", ["土瓦 Dawei"]);
    dsy.add("0_9_6", ["勃生 Pathein"]);
    dsy.add("0_9_7", ["仰光 Yangan "]);
    dsy.add("0_9_8", ["密支那 Myitkyina"]);
    dsy.add("0_9_9", ["垒固 Loi-kaw"]);
    dsy.add("0_9_10", ["巴安 Pa-an"]);
    dsy.add("0_9_11", ["哈卡 Haka"]);
    dsy.add("0_9_12", ["毛淡棉 Mawlamyine"]);
    dsy.add("0_9_13", ["实兑 Akyab"]);
    dsy.add("0_9_14", ["东枝 Taunggyi"]);


    dsy.add("0_10", ["巴登-符腾堡 Baden-Württemberg", "拜恩（巴伐利亚）  Bayern", "柏 林 Berlin", "勃兰登堡 Brandenburg", "不来梅 Bremen", "汉 堡 Hamburg", "黑 森 Hessen", "梅克伦堡-前波莫瑞 Mecklenburg-Vorpommern", "下萨克森  Niedersachsen", "北莱茵-威斯特法伦 Nordrhein-Westfalen", "莱茵兰-普法尔茨 Rheinland-Pfalz", "萨 尔 Saarland", "萨克森 Sachsen", "萨克森-安哈特 Sachsen-Anhalt", "石勒苏益格-荷尔斯泰因 Schleswig-Holstein", "图林根 Thüringen"]);
    dsy.add("0_10_0", ["斯图加特  Stuttgart", "卡尔斯鲁厄 Karlsruhe", "弗赖堡 Freiburg", "图宾根 Tübingen"]);
    dsy.add("0_10_1", ["慕尼黑 München ", "下拜恩 Niederbayern", "上普法尔茨 Oberpfalz", "上弗兰肯 Oberfranken", "中弗兰肯 Mittelfranken", "外弗兰肯 Unterfranken", "施瓦本 Schwaben"]);
    dsy.add("0_10_2", ["柏林 Berlin"]);
    dsy.add("0_10_3", ["波茨坦 Potsdam"]);
    dsy.add("0_10_4", ["不来梅 Bremen"]);
    dsy.add("0_10_5", ["汉堡 Hamburg"]);
    dsy.add("0_10_6", ["达姆施塔特 Darmstadt", "吉森 Gieben", "卡塞尔 Kassel"]);
    dsy.add("0_10_7", ["什未林 Schwerin"]);
    dsy.add("0_10_8", ["不伦瑞克 Braunschweig", "汉诺威  Hannover"]);
    dsy.add("0_10_9", ["杜塞尔多夫 Düsseldorf", "科隆 Koln", "明斯特 Münster", "代特莫尔特 Detmold"]);
    dsy.add("0_10_10", ["科布伦次 Koblenz ", "特里尔 Trier", "莱茵黑森-普法尔茨"]);
    dsy.add("0_10_11", ["萨尔布吕肯 Saarbrücken"]);
    dsy.add("0_10_12", ["开姆尼斯 Chemnitz", "德累斯顿 Dresden", "莱比锡 Leipzig"]);
    dsy.add("0_10_13", ["德绍 Dessau", "哈雷 Halle", "马格德堡 Magdeburg"]);
    dsy.add("0_10_14", ["基尔 Kiel"]);
    dsy.add("0_10_15", ["埃尔富特 Erfurt"]);


    dsy.add("0_11", ["英格兰 England", "威尔士 Wales", "苏格兰 Scotland", "北爱尔兰 Northern Ireland"]);
    dsy.add("0_11_0", ["坎布里亚 Cumbria", "兰开夏 Lancashire ", "布莱克本 Blackburn with Darwen", "大曼彻斯特 Greater Manchester", "柴郡 Cheshire ", "诺森伯兰 Northumberland", "达勒姆 Durham", "北约克郡 North Yorkshire", "约克郡东区 East Riding of Yorkshire", "西约克郡 West Yorkshire", "南约克郡 South Yorkshire", "林肯郡 Lincolnshire", "诺丁汉郡 Nottinghamshire", "斯塔福德郡 Staffordshire", "诺福克 Norfolk", "伦敦 London", "白金汉郡 Buckinghamshire", "牛津郡 Oxfordshire", "格洛斯特郡 Gloucestershire"]);
    dsy.add("0_11_1", ["康威 Conwy *", "圭内斯 Gwynedd", "锡尔迪金 Ceredigion", "波伊斯 Powys", "彭布罗克郡 Pembrokeshire", "卡马森郡 Carmarthenshire"]);
    dsy.add("0_11_2", ["苏格兰高地 Highland", "马里 Moray", "阿伯丁郡 Aberdeenshire", "安格斯 Angus", "珀斯-金罗斯 Perth and Kinross", "法夫 Fife", "斯特灵 Stirling", "阿盖尔-比特 Argyll and Bute", "苏格兰边界 Scottish Borders", "邓弗里斯-加洛韦 Dumfries and Galloway"]);
    dsy.add("0_11_3", ["阿兹 Ards", "卡斯尔雷 Castlereagh", "唐 Down", "贝尔法斯特 Belfast, City of", "利斯本 Lisburn", "巴利米纳 Ballymena", "莫伊尔 Moyle", "阿马 Armagh"]);


    dsy.add("0_12", ["法兰西岛 Ile-de-France", "香槟-阿登 Champagne-Ardenne", "皮卡第 Picardie", "上诺曼底 Haute-Normandie", "中央 Centre", "下诺曼底 Basse-Normandie", "勃艮第 Bourgogne", "北部-加莱海峡 Nord-pas-de-Calais", "洛林 Lorraine", "阿尔萨斯 Alsace", "弗朗什孔泰 Franche-Comté", "卢瓦尔河地区 Pays de la Loire", "布列塔尼 Bretagne", "普瓦图-夏朗德 Poitou-Charentes", "阿基坦 Aquitaine", "南部-比利牛斯 Midi-Pyrénées", "利穆赞 Limousin", "罗讷-阿尔卑斯 Rhone-Alpes", "奥弗涅 Auvergne", "朗格多克-鲁西永 Languedoc-Roussillon", "普罗旺斯-阿尔卑斯-蓝色海岸 Provence-Alpes-Cote d'Azur", "科西嘉 Corse"]);
    dsy.add("0_12_0", ["巴黎 Paris"]);
    dsy.add("0_12_1", ["兰斯 Reims"]);
    dsy.add("0_12_2", ["亚眠 Ameiens"]);
    dsy.add("0_12_3", ["鲁昂 Rouen"]);
    dsy.add("0_12_4", ["奥尔良 Orléans"]);
    dsy.add("0_12_5", ["卡昂 Caen"]);
    dsy.add("0_12_6", ["第戎 Dijon"]);
    dsy.add("0_12_7", ["里尔 Lille"]);
    dsy.add("0_12_8", ["南锡 Nancy"]);
    dsy.add("0_12_9", ["斯特拉斯堡 Strasbourg"]);
    dsy.add("0_12_10", ["贝桑松 Besancon"]);
    dsy.add("0_12_11", ["南特 Nantes"]);
    dsy.add("0_12_12", ["雷恩 Rennes"]);
    dsy.add("0_12_13", ["普瓦捷 Poitiers"]);
    dsy.add("0_12_14", ["波尔多 Bordeaux"]);
    dsy.add("0_12_15", ["图卢兹 Toulouse"]);
    dsy.add("0_12_16", ["利摩日 Limoges"]);
    dsy.add("0_12_17", ["里昂 Lyon"]);
    dsy.add("0_12_18", ["克莱蒙费朗 Clerment-Ferrand"]);
    dsy.add("0_12_19", ["蒙彼里埃 Montpellier"]);
    dsy.add("0_12_20", ["马赛 Marseille"]);
    dsy.add("0_12_21", ["阿雅克肖 Ajaccio"]);


    dsy.add("0_13", ["穆斯特省 Munster", "康诺特省 Connacht", "伦斯特省 Leinster", "阿尔斯特省 Ulster"]);
    dsy.add("0_13_0", ["科克 Cork", "沃特福德 Waterford", "利默里克 Limerick", "凯里 Kerry", "蒂珀雷里 Tipperary", "克莱尔 Clare"]);
    dsy.add("0_13_1", ["戈尔韦 Galway", "梅奥 Mayo", "罗斯康芒  Roscommon", "利特里姆  Leitrim", "斯莱戈 Sligo"]);
    dsy.add("0_13_2", ["都柏林 Dublin", "基尔代尔 Kildare", "米斯 Meath", "威克洛 Wicklow", "西米斯 Westmeath", "卡范 Cavan", "朗福德 Longford", "奥法利  Offaly", "崂斯  Laoighis", "卡洛 Carlow", "基尔肯尼 Kilkenny", "韦克斯福德 Wexford"]);
    dsy.add("0_13_3", ["劳斯 Louth", "多内加尔 Donegal", "莫内根 Monaghan", "阿马 Armagh", "安特里姆 Antrim", "德里 Derry", "唐 Down", "泰隆 Tyrone", "弗马纳 Fermanagh"]);


    dsy.add("0_14", ["下西里西亚 Dolnoslaskie", "库亚瓦滨海 Kujawsko-Pomorskie", "罗兹 Lódzkie ", "卢布林 Lubelskie", "鲁布斯卡 Lubuskie", "小波兰 Malopolskie", "马佐夫舍 Mazowieckie", "奥波莱 Opolskie", "喀尔巴阡山 Podkarpackie", "波德拉斯 Podlaskie", "滨海 Pomorskie", "西里西亚 Slaskie", "圣十字 Swietokrzyskie", "瓦尔米亚马祖尔 Warmińsko-Mazurskie", "大波兰 Wielkopolskie", "西滨海 Zachodniopomorskie"]);
    dsy.add("0_14_0", ["弗罗茨瓦夫", "耶莱尼亚古拉", "瓦乌布日赫", "莱格尼察"]);
    dsy.add("0_14_1", ["比得哥什", "托伦", "格鲁琼兹", "弗沃茨瓦韦克"]);
    dsy.add("0_14_2", ["罗兹", "彼得库夫", "斯凯尔涅维采", "谢拉兹"]);
    dsy.add("0_14_3", ["卢布林", "海乌姆", "扎莫希奇", "比亚瓦波德拉斯卡"]);
    dsy.add("0_14_4", ["绿山城", "大波兰地区戈茹夫"]);
    dsy.add("0_14_5", ["克拉科夫", "塔尔努夫", "新松奇"]);
    dsy.add("0_14_6", ["华沙", "切哈努夫", "普沃茨克", "奥斯特罗文卡", "谢德尔采", "拉多姆"]);
    dsy.add("0_14_7", ["奥波莱"]);
    dsy.add("0_14_8", ["热舒夫", "塔尔诺布热格", "克罗斯诺", "普热梅希尔"]);
    dsy.add("0_14_9", ["比亚维斯托克", "苏瓦乌基", "沃姆扎"]);
    dsy.add("0_14_10", ["格但斯克", "格丁尼亚", "索波特", "斯武普斯克"]);
    dsy.add("0_14_11", ["卡托维兹", "琴斯托霍瓦", "别尔斯科-比亚瓦", "雷布尼克", "索斯诺维茨", "格利维采", "比托姆"]);
    dsy.add("0_14_12", ["凯尔采"]);
    dsy.add("0_14_13", ["奥尔什丁", "埃尔布隆格"]);
    dsy.add("0_14_14", ["波兹南", "皮瓦", "卡利什", "莱什诺", "科宁"]);
    dsy.add("0_14_15", ["什切青", "科沙林", "希维诺乌伊希切"]);


    dsy.add("0_15", ["安达卢西亚 Andalucía", "阿拉贡 Aragón", "阿斯图利亚斯 Asturias", "巴利阿里群岛 Baleares", "加那利 Canarias", "坎塔布利亚 Cantábria", "卡斯蒂利亚－拉曼恰 Castilla-La Mancha", "卡斯蒂利亚－莱昂 Castilla y Léon", "加泰罗尼亚* Cataluna", "加利西亚* Galicia", "马德里 Madrid"]);
    dsy.add("0_15_0", ["阿尔梅里亚 Almería", "加的斯 Cádiz", "科尔多瓦 Córdoba", "格拉纳达 Granada", "韦尔瓦 Huelva", "哈恩 Jáen", "马拉加 Málaga", "塞维利亚 Sevilla"]);
    dsy.add("0_15_1", ["韦斯卡 Huesca", "特鲁埃尔 Teruel", "萨拉戈萨 Zaragoza"]);
    dsy.add("0_15_2", ["奥维耶多 Oviedo"]);
    dsy.add("0_15_3", ["巴利阿里 Baleares"]);
    dsy.add("0_15_4", ["拉斯帕尔马斯 Las Palmas", "圣克鲁斯-德特内里费 Santa Cruz de Tenerife"]);
    dsy.add("0_15_5", ["桑坦德 Santander"]);
    dsy.add("0_15_6", ["阿尔瓦塞特 Albacete", "雷阿尔城 Ciudad Real", "昆卡 Cuenca", "瓜达拉哈拉 Guadalajara", "托莱多 Toledo"]);
    dsy.add("0_15_7", ["阿维拉 ávila", "布尔戈斯 Burgos", "莱昂 León", "帕伦西亚 Palencia", "萨拉曼卡 Salamanca", "塞哥维亚 Segovia", "索里亚 Soria", "巴利亚多利德 Valladolid", "萨莫拉 Zamora"]);
    dsy.add("0_15_8", ["巴塞罗那 Barcelona", "赫罗纳 Gerona", "莱里达 Lérida", "塔拉戈纳 Tarragona"]);
    dsy.add("0_15_9", ["拉科鲁尼亚 A Coruna", "卢戈 Lugo", "奥伦塞 Ourense", "蓬特韦德拉 Pontevedra"]);
    dsy.add("0_15_10", ["马德里 Madrid"]);
    dsy.add("0_16", ["阿布鲁佐 Abruzzi", "巴西利卡塔 Basilicata", "卡拉布里亚 Calabria", "坎帕尼亚 Campania", "艾米利亚－罗马涅 Emilia-Romagna", "弗留利－威尼斯·朱利亚* Friuli-Venezia Giulia", "拉齐奥 Lazio", "利古里亚 Liguria", "伦巴第 Lombardia", "马尔凯 Marche", "莫利塞 Molise", "皮埃蒙特 Piemonte", "普利亚 Puglia", "撒丁* Sardegna", "西西里* Sicilia", "托斯卡纳 Toscana", "特伦蒂诺-上阿迪杰* Trentino-Alto Adige", "翁布里亚 Umbria", "瓦莱·达奥斯塔* Valle d'Aosta", "威尼托 Veneto"]);
    dsy.add("0_16_0", ["拉奎拉 L'Aquila"]);
    dsy.add("0_16_1", ["波坦察 Potenza"]);
    dsy.add("0_16_2", ["卡坦扎罗 Catanzaro"]);
    dsy.add("0_16_3", ["那波利 Napoli"]);
    dsy.add("0_16_4", ["博洛尼亚 Bologna"]);
    dsy.add("0_16_5", ["的里雅斯特 Trieste"]);
    dsy.add("0_16_6", ["罗马 Roma"]);
    dsy.add("0_16_7", ["热那亚 Genova"]);
    dsy.add("0_16_8", ["米兰 Milano"]);
    dsy.add("0_16_9", ["安科纳 Ancona"]);
    dsy.add("0_16_10", ["坎波巴索 Campobasso"]);
    dsy.add("0_16_11", ["都灵 Torino"]);
    dsy.add("0_16_12", ["巴里 Bari"]);
    dsy.add("0_16_13", ["卡利亚里 Cagliari"]);
    dsy.add("0_16_14", ["巴勒莫 Palermo"]);
    dsy.add("0_16_15", ["佛罗伦萨 Firenze"]);
    dsy.add("0_16_16", ["特伦托 Trento"]);
    dsy.add("0_16_17", ["佩鲁贾 Perugia"]);
    dsy.add("0_16_18", ["奥斯塔 Aosta"]);
    dsy.add("0_16_19", ["威尼斯 Venezia"]);
    dsy.add("0_17", ["西北 Severo-Zapadnyj", "中央 Central'nyj ", "南方 Juznyj ", "伏尔加 Privolzskij ", "乌拉尔 Ural'skij", "西伯利亚 Sibirskij", "远东 Dal'nevostocnij"]);
    dsy.add("0_17_0", ["阿尔汉格尔斯克州 Archangel'sk Obl.", "涅涅茨自治区 Nenetskiy AOK", "圣彼得堡市 Gorod Sankt-Peterburg", "加里宁格勒州 Kaliningrad Obl.", "卡累利阿共和国 Karelija ARep.", "科米共和国 Komi ARep.", "列宁格勒州 Leningrad Obl.", "摩尔曼斯克州 Murmansk Obl.", "诺夫哥罗德州 Novgorod Obl.", "普斯科夫州 Pskov Obl.", "沃洛格达州 Vologda Obl."]);
    dsy.add("0_17_1", ["别尔哥罗德州 Belgorod Obl.", "布良斯克州 Br'ansk Obl.", "莫斯科市 Gorod Moskva.", "伊万诺沃州 Ivanovo Obl.", "雅罗斯拉夫尔州 Jaroslavl' Obl.", "卡卢加州 Kaluga Obl.", "库尔斯克州 Kursk Obl.", "莫斯科州 Moskva Obl."]);
    dsy.add("0_17_2", ["阿迪格共和国 Adygeja ARep.", "阿斯特拉罕州 Astrachan' Obl.", "车臣共和国 Cecenija ARep.", "达吉斯坦共和国 Dagestan  ARep.", "印古什共和国 Ingusetija ARep.", "卡巴尔达－巴尔卡尔共和国 Kabardino-Balkarija ARep.", "卡尔梅克共和国 Kalmykija ARep.", "卡拉恰耶夫－切尔克斯共和国 Karacajevo-Cerkesija ARep.", "克拉斯诺达尔边疆区 Krasnodar Kraj.", "罗斯托夫州 Rostov Obl.", "北奥塞梯－阿兰社会主义共和国 Severnaja Osetija-Alanija ARep.", "斯塔夫罗波尔边疆区 Stavropol' Kraj.", "伏尔加格勒州 Volgograd Obl."]);
    dsy.add("0_17_3", ["巴什科尔托 斯坦共和国 Ba?kortostan ARep.", "楚瓦什共和国 ?uva?ija  ARep.", "基洛夫州 Kirov  Obl.", "马里－埃尔共和国 Marij El  ARep.", "莫尔多瓦社会主义共和国 Mordovija  ARep.", "下诺夫哥罗德州 Niznij Novgorod  Obl.", "奥伦堡州 Orenburg  Obl.", "奔萨州 Penza  Obl.", "彼尔姆州 Perm'  Obl.", " 科米－彼尔米亚克自治区  Komi-Permyatskiy AOK", "萨马拉州 Samara  Obl.", "萨拉托夫州 Saratov  Obl."]);
    dsy.add("0_17_4", [" 车里雅宾斯克州 Cel'abinsk Obl.", "库尔干州 Kurgan Obl.", "斯维尔德洛夫斯克州 Sverdlovsk Obl.", "秋明州 T'umen' Obl.", "汉特－曼西自治区 Khanty-Mansiyskiy AOK", "亚马尔－涅涅茨自治区 Yamalo-Nenetskiy AOK"]);
    dsy.add("0_17_5", ["赤塔州 Cita Obl.", "Чита г. 赤塔市", "Балей 巴列伊市", "Петровск-Забайкальский г. 外贝加尔的彼得罗夫斯克市", "Борзя г. 博尔贾市", "Краснокаменск г. 克拉斯诺卡缅斯克市", "Северобайкальск г. 北贝加尔斯克市", "Улан-Удэ г. 乌兰乌德市", "Гусиноозерск г. 古西诺奥泽尔斯克市", "伊尔库茨克州 Irkutsk Obl.", "Усть-Кут г. 乌斯季库特市", "Бодайбо 博代博市", "Тайшет г. 泰舍特市", "Братск г. 布拉茨克市", "Нижнеудинск г. 下乌金斯克市", "Тулун 图伦市", "Саянск 萨彦斯克市", "特瓦共和国 Tyva ARep.", "克拉斯诺亚尔斯克边疆区 Krasnojarsk ARep.", "哈卡斯共和国 Chakasija ARep.", "阿尔泰共和国 Altaj  ARep.", "阿尔泰边疆区 Altaskij Kraj", "克麦罗沃州 Kemerovo Obl.", "新西伯利亚州 Novosibirsk Obl.", "托木斯克州 Tomsk Obl.", "鄂木斯克州 Omsk Obl."]);
    dsy.add("0_17_6", ["滨海边疆区 Приморский край/ Primorskij Kraj.", "哈巴罗夫斯克边疆区 Хабаровский край/ Chabarovsk Kraj.", "犹太自治州 Еврейская автономная область/Jevrej AArea.", "阿穆尔州 Amur Obl.", "萨哈林州 Sakhalin Obl.", "马加丹州 Magadan Obl.", "勘察加州 Kamcatka Obl.", "楚科奇自治专区 Cukotskij Avtonomnyj Okrug AArea.", "萨哈（雅库特）共和国 Sacha (Jakutija) ARep."]);


    dsy.add("0_18", ["德伦特 Drenthe", "弗莱福兰 Flevoland", "弗里斯兰Friesland", "海尔德兰 Gelderland", "格罗宁根 Groningen", "林堡 Limburg", "北布拉班特 Noord-Brabant", "北荷兰 Noord-Holland ", "上艾瑟尔 Overijssel", "乌得勒支 Utrecht", "泽兰 Zeeland", "南荷兰 Zuid-Holland"]);
    dsy.add("0_18_0", ["阿森 Assen", "埃门 Emmen"]);
    dsy.add("0_18_1", ["莱利斯塔德 Lelystad", "阿尔梅勒 Almere"]);
    dsy.add("0_18_2", ["吕伐登 Leeuwarden"]);
    dsy.add("0_18_3", ["阿纳姆 Arnhem", "阿珀尔多伦 Apeldoorn", "埃德 Ede", "奈梅亨 Nijmegen"]);
    dsy.add("0_18_4", ["格罗宁根 Groningen"]);
    dsy.add("0_18_5", ["马斯特里赫特 Maastricht"]);
    dsy.add("0_18_6", ["斯海尔托亨博思 's-Hertogenbosch", "布雷达 Breda", "艾恩德霍芬 Eindhoven", "蒂尔堡 Tilburg"]);
    dsy.add("0_18_7", ["哈勒姆 Haarlem", "阿姆斯特丹 Amsterdam", "赞济科 Zaandijk", "霍夫多尔普 Hoofddorp"]);
    dsy.add("0_18_8", ["兹沃勒 Zwolle", "恩斯赫德 Enschede"]);
    dsy.add("0_18_9", ["乌得勒支 Utrecht", "阿默斯福特 Amersfoort"]);
    dsy.add("0_18_10", ["米德尔堡 Middelburg"]);
    dsy.add("0_18_11", ["海牙 's-Gravenhage", "鹿特丹 Rotterdam", "多德雷赫特 Dordrecht", "莱顿 Leiden", "佐特尔梅 Zoetermeer"]);


    dsy.add("0_19", ["阿拉巴马 Alabama", "阿拉斯加 Alaska", "亚利桑那 Arizona", "阿肯色 Arkansas", "加利福尼亚 California", "科罗拉多 Colorado", "康涅狄格 Connecticut", "特拉华 Delaware", "哥伦比亚特区 District of Columbia", "佛罗里达 Florida", "乔治亚 Georgia", "夏威夷 Hawaii", "爱达荷 Idaho", "伊利诺斯 Illinois", "印地安那 Indiana", "衣阿华 Iowa", "堪萨斯 Kansas", "肯塔基 Kentucky", "路易斯安那 Louisiana", "缅因 Maine", "马里兰 Maryland", "马萨诸塞 Massachusetts", "密歇根 Michigan", "明尼苏达 Minnesota", "密西西比 Mississippi", "密苏里 Missouri", "蒙大拿 Montana", "内布拉斯加 Nebraska", "内华达 Nevada", "新罕布什尔 New Hampshire", "新泽西 New Jersey", "新墨西哥 New Mexico", "纽约 New York", "犹他 Utah", "华盛顿 Washington", "威斯康星 Wisconsin"]);
    dsy.add("0_19_0", ["蒙哥马利 Montgomery"]);
    dsy.add("0_19_1", ["朱诺 Juneau"]);
    dsy.add("0_19_2", ["菲尼克斯 Phoenix"]);
    dsy.add("0_19_3", ["小石城 Little Rock"]);
    dsy.add("0_19_4", ["萨克拉门多 Sacramento"]);
    dsy.add("0_19_5", ["丹佛 Denver"]);
    dsy.add("0_19_6", ["哈特福德 Hartford"]);
    dsy.add("0_19_7", ["多佛 Dover"]);
    dsy.add("0_19_8", ["华盛顿 Washington"]);
    dsy.add("0_19_9", ["塔拉哈西 Tallahassee"]);
    dsy.add("0_19_10", ["亚特兰大 Atlanta"]);
    dsy.add("0_19_11", ["檀香山 Honolulu"]);
    dsy.add("0_19_12", ["博伊亚 Boise"]);
    dsy.add("0_19_13", ["斯普林菲尔德 Springfield"]);
    dsy.add("0_19_14", ["印第安纳波利斯 Indianapolis"]);
    dsy.add("0_19_15", ["得梅因 Des Moines"]);
    dsy.add("0_19_16", ["托皮卡 Topeka"]);
    dsy.add("0_19_17", ["法兰克福 Frankfort"]);
    dsy.add("0_19_18", ["巴吞鲁日 Baton Rouge"]);
    dsy.add("0_19_19", ["奥古斯塔 Augusta"]);
    dsy.add("0_19_20", ["安纳波利斯 Annapolis"]);
    dsy.add("0_19_21", ["波土顿 Boston"]);
    dsy.add("0_19_22", ["兰辛 Lansing"]);
    dsy.add("0_19_23", ["圣保罗 St.Paul"]);
    dsy.add("0_19_24", ["杰克逊 Jackson"]);
    dsy.add("0_19_25", ["杰斐逊城 Jefferson City"]);
    dsy.add("0_19_26", ["赫勒纳 Helena"]);
    dsy.add("0_19_27", ["林肯 Lincoln"]);
    dsy.add("0_19_28", ["卡森城 Carson City"]);
    dsy.add("0_19_29", ["康科德 Concord"]);
    dsy.add("0_19_30", ["特伦顿 Trenton"]);
    dsy.add("0_19_31", ["圣菲 Santa Fe"]);
    dsy.add("0_19_32", ["奥尔巴尼 Albany"]);
    dsy.add("0_19_33", ["盐湖城 Salt Lake City"]);
    dsy.add("0_19_34", ["奥林匹亚 Olympia"]);
    dsy.add("0_19_35", ["麦迪逊 Madison"]);


    dsy.add("0_20", ["新不伦瑞克省 New Brunswick", "新斯科舍省 Nova Scotia", "安大略省 Ontario", "魁北克省 Québec", "马尼托巴省 Manitoba", "不列颠哥伦比亚省 British Columbia", "爱德华王子岛省 Prince Edward Island", "艾伯塔省 Alberta", "萨斯喀彻温省 Saskatchewan", "纽芬兰-拉布拉多省 Newfoundland-Labrador", "西北地区 Northwest Territories", "育空地区 Yukon Territory", "努纳维特地区 Nunavut Territory"]);
    dsy.add("0_20_0", ["弗雷德里顿 Fredericton"]);
    dsy.add("0_20_1", ["哈利法克斯 Halifax", "布列塔尼角 Cape Breton"]);
    dsy.add("0_20_2", ["多伦多 Toronto", "渥太华 Ottawa", "哈密尔顿 Hamilton", "基奇纳 Kitchener", "伦敦 London", "圣卡塔琳娜 St. Catharines", "温莎 Windsor", "奥沙瓦 Oshawa", "巴里 Barrie", "金斯敦 Kingston", "圭尔夫 Guelph", "萨德伯里 Sudbury", "桑德贝 Thunder Bay"]);
    dsy.add("0_20_3", ["魁北克 Québec", "蒙特利尔 Montréal", "舍布鲁克 Sherbrooke", "钻石城 Trois-Rivières", "希格蒂米 Chicoutimi"]);
    dsy.add("0_20_4", ["温尼伯 Winnipeg"]);
    dsy.add("0_20_5", ["维多利亚 Victoria", "温哥华 Vancouver", "阿伯茨福 Abbotsford", "基劳纳 Kelowna"]);
    dsy.add("0_20_6", ["夏洛特敦 Charlottetown"]);
    dsy.add("0_20_7", ["埃德蒙顿 Edmonton", "卡里加里 Calgary"]);
    dsy.add("0_20_8", ["里贾纳 Regina", "萨斯卡通 Saskatoon"]);
    dsy.add("0_20_9", ["圣约翰斯 Saint-John's"]);
    dsy.add("0_20_10", ["耶洛奈夫 Yellowknife"]);
    dsy.add("0_20_11", ["怀特霍斯 Whitehorse"]);
    dsy.add("0_20_12", ["伊魁特 Iqaluit"]);


    dsy.add("0_21", ["联邦首都 Distrito Federal", "戈亚斯 Goiás", "马托格罗索 Mato Grosso", "南马托格罗索 Mato Grosso do Sul", "阿拉戈斯 Alagoas", "巴伊亚 Bahia", "塞阿拉 Ceará", "马拉尼昂 Maranhao", "帕拉伊巴 Paraíba", "伯南布哥 Pernambuco", "皮奥伊 Piauí", "北里奥格兰德 Rio Grande do Norte", "塞尔希培 Sergipe", "阿克里 Acre", "阿马帕 Amapá", "亚马孙 Amazonas", "帕拉 Pará", "朗多尼亚 Rondonia", "罗赖马 Roraima", "托坎廷斯 Tocantins", "圣埃斯皮里图 Espírito Santo*", "米纳斯吉拉斯 Minas Gerais", "里约热内卢 Rio de Janeiro", "圣保罗 Sao Paulo", "巴拉那 Paraná", "南里奥格兰德 Rio Grande do Sul**", "圣卡塔琳娜 Santa Catarina"]);
    dsy.add("0_21_0", ["巴西利亚 Brasília"]);
    dsy.add("0_21_1", ["戈亚尼亚 Goiania"]);
    dsy.add("0_21_2", ["库亚巴 Cuiabá"]);
    dsy.add("0_21_3", ["大坎普 Campo Grande"]);
    dsy.add("0_21_4", ["马塞约 Maceió"]);
    dsy.add("0_21_5", ["萨尔瓦多 Salvador"]);
    dsy.add("0_21_6", ["福塔莱萨 Fortaleza"]);
    dsy.add("0_21_7", ["圣路易斯 Sao Luís"]);
    dsy.add("0_21_8", ["若昂佩索阿 Joao Pessoa"]);
    dsy.add("0_21_9", ["累西腓 Recife"]);
    dsy.add("0_21_10", ["特雷西纳 Teresina"]);
    dsy.add("0_21_11", ["纳塔尔 Natal"]);
    dsy.add("0_21_12", ["阿拉卡茹 Aracaju"]);
    dsy.add("0_21_13", ["里奥布朗库 Rio Branco"]);
    dsy.add("0_21_14", ["马卡帕 Macapá"]);
    dsy.add("0_21_15", ["马瑙斯 Manaus"]);
    dsy.add("0_21_16", ["贝伦 Belém"]);
    dsy.add("0_21_17", ["波多韦柳 Porto Velho"]);
    dsy.add("0_21_18", ["沃阿维斯塔 Boa Vista"]);
    dsy.add("0_21_19", ["帕尔马斯 Palmas"]);
    dsy.add("0_21_20", ["维多利亚 Vitória"]);
    dsy.add("0_21_21", ["贝洛奥里藏特 Belo Horizonte"]);
    dsy.add("0_21_22", ["里约热内卢 Rio de Janeiro"]);
    dsy.add("0_21_23", ["圣保罗 Sao Paulo"]);
    dsy.add("0_21_24", ["库里蒂巴 Curitiba"]);
    dsy.add("0_21_25", ["阿雷格里港 Porto Alegre"]);
    dsy.add("0_21_26", ["弗洛里亚诺波利斯 Florianópolis"]);


    dsy.add("0_22", ["联邦首都 Distrito Federal", "布宜诺斯艾利斯 Buenos Aires", "卡塔马卡 Catamarca", "查科 Chaco", "丘布特 Chubut", "科尔多瓦  Córdoba", "科连特斯 Corrientes", "恩特雷里奥斯 Entre Ríos", "福莫萨 Formosa", "胡胡伊 Jujuy", "拉潘帕 La Pampa", "拉里奥哈 La Rioja", "门多萨　Mendoza", "米西奥斯内斯　Misiones", "内乌肯　Neuquén", "里奥内格罗 Río Negro", "萨尔塔　Salta", "圣胡安　San Juan", "圣路易斯　San Luis", "圣克鲁斯　Santa Cruz", "圣菲　Santa Fe", "圣地亚哥-德尔埃斯特罗 Santiago del Estero", "火地岛　Tierra del Fuego", "图库曼　Tucumán"]);
    dsy.add("0_22_0", ["布宜诺斯艾利斯  Buenos Aires"]);
    dsy.add("0_22_1", ["拉普拉塔 La Plata", "布兰卡港 Bahía Blanca", "马德普拉塔 Mar del Plata", "圣尼古拉斯 San Nic+olás"]);
    dsy.add("0_22_2", ["卡塔马卡 Catamarca"]);
    dsy.add("0_22_3", ["雷西斯滕匹亚　Resistencia"]);
    dsy.add("0_22_4", ["罗森 Rawson", "特雷利乌Trelew", "里瓦达维亚海军准将城 Comodoro Rivadavia"]);
    dsy.add("0_22_5", ["科尔多瓦 Córdoba", "里奥夸尔托 Río Cuarto"]);
    dsy.add("0_22_6", ["科连特斯 Corrientes"]);
    dsy.add("0_22_7", ["巴拉那　Paraná", "肯考迪娅 Concordia"]);
    dsy.add("0_22_8", ["福莫萨　Formosa"]);
    dsy.add("0_22_9", ["胡胡伊 Jujuy"]);
    dsy.add("0_22_10", ["圣罗莎　Santa Rosa"]);
    dsy.add("0_22_11", ["拉里奥哈　La Rioja"]);
    dsy.add("0_22_12", ["门多萨 Mendoza", "圣拉斐尔 San Rafael"]);
    dsy.add("0_22_13", ["波萨达斯　Posadas"]);
    dsy.add("0_22_14", ["内乌肯　Neuquén"]);
    dsy.add("0_22_15", ["别德马　Viedma"]);
    dsy.add("0_22_16", ["萨尔塔　Salta"]);
    dsy.add("0_22_17", ["圣胡安　San Juan", "克劳斯城 Villa Krause (Rawson)", "圣路易斯 San Luis"]);
    dsy.add("0_22_18", ["圣路易斯　San Luis"]);
    dsy.add("0_22_19", ["里奥加耶戈斯　Río Gallegos"]);
    dsy.add("0_22_20", ["圣菲　Santa Fe", "罗萨里奥 Rosario"]);
    dsy.add("0_22_21", ["圣地亚哥-德尔埃斯特罗 Santiago del Estero"]);
    dsy.add("0_22_22", ["乌斯怀亚　Ushuaia"]);
    dsy.add("0_22_23", ["圣米格尔-德图库曼 San Miguel de Tucumán"]);


    dsy.add("0_23", ["北地 Northland", "奥克兰 Auckland", "怀卡托 Waikato ", "普伦蒂湾 Bay of Plenty", "吉斯伯恩 Gisborne (A) ", "霍克湾 Hawkes Bay ", "玛纳瓦图/旺格努伊 Manawatu-Wanganui ", "塔拉那基 Taranaki", "惠灵顿 Wellington ", "塔斯曼 Tasman (A)", "纳尔逊 Nelson (B)", "马尔伯勒 Blenheim (A)", "西岸 West Coast", "坎特伯雷 Canterbury ", "奥塔戈 Otago ", "南地 Southland"]);
    dsy.add("0_23_0", ["旺阿雷 Whangarei ", "北远 Far North ", "凯帕拉 Kaipara"]);
    dsy.add("0_23_1", ["奥克兰 Auckland", "马努考 Manukau", "北岸 North Shore", "怀塔科拉 Waitakere", "罗得尼 Rodney", "帕帕库拉 Papakura", "富兰克林 Franklin (1)"]);
    dsy.add("0_23_2", ["哈密尔顿  Hamilton", "怀卡托 Waikato", "怀帕 Waipa", "Otorohanga", "Waitomo (7)", "Thames-Coromandel", "Hauraki"]);
    dsy.add("0_23_3", ["Tauranga", "Western Bay op Plenty", "Rotorua (2)", "Taupo (3)", "瓦卡塔尼 Whakatane", "Kawerau", "Opotiki"]);
    dsy.add("0_23_4", ["吉斯伯恩 Gisborne"]);
    dsy.add("0_23_5", ["内皮尔 Napier", "Wairoa", "Taupo (3)", "Hastings", "Rangitikei (4)", "Central Hawke's Bay"]);
    dsy.add("0_23_6", ["北帕默斯顿 Palmerston North", "Tararua (6)", "Horowhenua", "Manawatu", "Rangitikei (4)", "Ruapehu", "Wanganui", "斯特拉特福德 Stratford (5)"]);
    dsy.add("0_23_7", ["新普利茅斯 New Plymouth", "斯特拉特福德 Stratford (5)", "南塔拉纳基 South Taranaki"]);
    dsy.add("0_23_8", ["Wellington", "Lower Hutt ( Hutt )", "Porirua", "Upper Hutt", "Kapiti Coast", "Masterton", "Carterton", "South Wairarapa"]);
    dsy.add("0_23_9", ["里士满 Richmond"]);
    dsy.add("0_23_10", ["纳尔逊  Nelson"]);
    dsy.add("0_23_11", ["布莱尼姆  Blenheim"]);
    dsy.add("0_23_12", ["格雷茅斯 Greymouth ", "Buller", "格雷 Grey", "西地 Westland"]);
    dsy.add("0_23_13", ["基督城 Christchurch", "Kaikoura", "Hurunui", "班克斯半岛 Banks Peninsula", "塞尔温 Selwyn"]);
    dsy.add("0_23_14", ["达尼丁 Dunedin", "中奥塔戈 Central Otago", "Queenstown-Lakes"]);
    dsy.add("0_23_15", ["因弗卡吉尔 Invercargill", "Gore", "南地 Southland"]);


    dsy.add("0_24", ["新南威尔士州 New South Wales", "昆士兰州 Queensland", "南澳大利亚州 South Australia", "塔斯马尼亚州 Tasmania", "维多利亚州 Victoria", "西澳大利亚州 Western Australia", "澳大利亚首都地区 Australian Capital Territory", "北部地区 Northern Territory"]);
    dsy.add("0_24_0", ["悉尼 Sydney", "伍伦贡 Wollongong", "纽卡斯尔 Newcastle"]);
    dsy.add("0_24_1", ["布里斯班 Brisbane", "黄金海岸 Gold Coast", "日光海岸 Caloundra", "汤斯维尔 Townsville", "凯恩斯 Cairns", "图文巴 Toowoomba"]);
    dsy.add("0_24_2", ["阿德莱德 Adelaide"]);
    dsy.add("0_24_3", ["霍巴特 Hobart"]);
    dsy.add("0_24_4", ["墨尔本 Melbourne", "吉朗 Geelong "]);
    dsy.add("0_24_5", ["珀斯 Perth"]);
    dsy.add("0_24_6", ["堪培拉 Canberra"]);
    dsy.add("0_24_7", ["达尔文 Darwin"]);


    dsy.add("0_25", ["查谟和克什米尔* Jammu & Kashmīr", "旁遮普 Punjub", "昌迪加尔 Chandīgarh", "喜马偕尔邦 Himāchal Pradesh", "北安查尔 Uttaranchal", "哈里亚纳 Haryāna", "德里 Delhi", "拉贾斯坦 Rājasthān", "北方邦 Uttar Pradesh", "中央邦 Madhya Pradesh", "查蒂斯加尔 Chhatisgarh", "比哈尔 Bihār", "贾坎德 Jharkhand", "锡金 Sikkim", "阿鲁那恰尔邦* Arunāchal Pradesh", "那加兰 Nāgāland", "曼尼普尔 Manipur", "米佐拉姆 Mizorām", "特里普拉 Tripura", "梅加拉亚  Meghālaya", "阿萨姆 Assam", "西孟加拉邦 West Bengal", "奥里萨 Orissa", "古吉拉特 Gujarāt", "达曼和第乌 Damān & Diu", "达德拉和纳加尔哈维利 Dādra & Nagar Haveli", "马哈拉施特拉 Mahārāshtra", "果阿 Goa", "安得拉邦 Andhra Pradesh", "卡纳塔克 Karnātaka", "拉克沙群岛 Lakshadweep", "喀拉拉 Kerala", "泰米尔纳德 Tamil Nādu", "本地治里 Pondicherry", "安达曼和尼科巴群岛 Andaman & Nicobar Islands"]);
    dsy.add("0_25_0", ["斯利那加 Srinagar"]);
    dsy.add("0_25_1", ["昌迪加尔 Chandigarh"]);
    dsy.add("0_25_2", ["昌迪加尔 Chandigarh"]);
    dsy.add("0_25_3", ["西姆拉 Simla"]);
    dsy.add("0_25_4", ["德拉敦 Dehra Dun"]);
    dsy.add("0_25_5", ["昌迪加尔 Chandigarh"]);
    dsy.add("0_25_6", ["德里 Delhi"]);
    dsy.add("0_25_7", ["斋浦尔 Jaipur"]);
    dsy.add("0_25_8", ["勒克瑙 Lucknow"]);
    dsy.add("0_25_9", ["博帕尔 Bhopal"]);
    dsy.add("0_25_10", ["赖布尔 Raipur"]);
    dsy.add("0_25_11", ["巴特那 Patna"]);
    dsy.add("0_25_12", ["兰契 Ranchi"]);
    dsy.add("0_25_13", ["甘托克 Gangtok"]);
    dsy.add("0_25_14", ["伊塔那噶 Itanagar"]);
    dsy.add("0_25_15", ["科希马 Kohima"]);
    dsy.add("0_25_16", ["因帕尔 Imphal"]);
    dsy.add("0_25_17", ["艾藻尔 Aizawl"]);
    dsy.add("0_25_18", ["阿加尔塔拉 Agartala"]);
    dsy.add("0_25_19", ["西隆 Shillong"]);
    dsy.add("0_25_20", ["迪斯布尔 Dispur"]);
    dsy.add("0_25_21", ["加尔各答 Kolkata"]);
    dsy.add("0_25_22", ["布巴内斯瓦尔 Bhubaneswar"]);
    dsy.add("0_25_23", ["甘地讷格尔 Gandhinagar"]);
    dsy.add("0_25_24", ["达曼 Daman"]);
    dsy.add("0_25_25", ["锡尔瓦萨 Silvassa"]);
    dsy.add("0_25_26", ["孟买 Mumbai"]);
    dsy.add("0_25_27", ["帕那吉 Panaji"]);
    dsy.add("0_25_28", ["海得拉巴 Hyderabad"]);
    dsy.add("0_25_29", ["班加罗尔 Bangalore"]);
    dsy.add("0_25_30", ["卡瓦拉蒂 Kavaratti"]);
    dsy.add("0_25_31", ["特里凡得琅 Thiruvananthapuram"]);
    dsy.add("0_25_32", ["金奈 Chennai"]);
    dsy.add("0_25_33", ["本地治里 Pondicherry"]);
    dsy.add("0_25_34", ["布莱尔港 Port Blair"]);


    dsy.add("0_26", ["开罗 Al Qahirah", "亚历山大 Al Iskandariyah", "塞得港 Bur Sa`id", "苏伊士 As Suways", "卢克索 Al Uqsur", "代盖赫利耶 Ad Daqahl?yah", "布海拉 Al Buhayrah", "西部 Al Gharbiyah", "伊斯梅利亚 Al Isma`iliyah", "米努夫 Al Minufiyah", "盖勒尤卜 Al Qalyubiyah", "东部 Ash Sharqiyah", "杜姆亚特 Dumyat", "谢赫村 Kafr ash Shaykh", "吉萨 Al Jizah", "明亚 Al Minya", "贝尼苏韦夫 Bani Suwayf", "法尤姆 Al Fayyum", "艾斯尤特 Asyut", "阿斯旺 Aswan", "索哈杰 Suhaj", "基纳 Qina", "红海 Al Bahr al Ahmar", "新河谷 Al Wadi al Jadid", "马特鲁 Matruh", "南西奈 Janub Sina", "北西奈 Shamal Sina"]);
    dsy.add("0_26_0", ["开罗 Al Qahirah"]);
    dsy.add("0_26_1", ["亚历山大 Al Iskandariyah"]);
    dsy.add("0_26_2", ["塞得港 Bur Sa`id"]);
    dsy.add("0_26_3", ["苏伊士 As Suways"]);
    dsy.add("0_26_4", ["卢克索 Al Uqsur"]);
    dsy.add("0_26_5", ["曼苏拉 Al Mansurah", "米特加穆尔 Mit Ghamr"]);
    dsy.add("0_26_6", ["达曼胡尔 Damanhur", "达沃 Kafr ad-Dawwar"]);
    dsy.add("0_26_7", ["坦塔 Tanta", "马哈拉库布拉 Al-Mahallah al-Kubra"]);
    dsy.add("0_26_8", ["伊斯梅利亚 Al Isma`iliyah"]);
    dsy.add("0_26_9", ["希宾库姆 Shibin al Kawm"]);
    dsy.add("0_26_10", ["本哈 Banha", "苏布拉开马 Shubra al-Khaymah"]);
    dsy.add("0_26_11", ["宰加济格 Az Zaqaziq", "比勒拜斯 Bilbays"]);
    dsy.add("0_26_12", ["杜姆亚特 Dumyat"]);
    dsy.add("0_26_13", ["谢赫村 Kafr ash Shaykh"]);
    dsy.add("0_26_14", ["吉萨 Al Jizah"]);
    dsy.add("0_26_15", ["明亚 Al Minya", "迈莱维 Mallawi"]);
    dsy.add("0_26_16", ["贝尼苏韦夫 Bani Suwayf"]);
    dsy.add("0_26_17", ["法尤姆 Al Fayyum"]);
    dsy.add("0_26_18", ["艾斯尤特 Asyut"]);
    dsy.add("0_26_19", ["阿斯旺 Aswan"]);
    dsy.add("0_26_20", ["索哈杰 Suhaj"]);
    dsy.add("0_26_21", ["基纳 Qina"]);
    dsy.add("0_26_22", ["古尔代盖 Al Ghurdaqah"]);
    dsy.add("0_26_23", ["哈里杰 Al Kharijah"]);
    dsy.add("0_26_24", ["马特鲁 Matruh"]);
    dsy.add("0_26_25", ["图尔 Janub Sina"]);
    dsy.add("0_26_26", ["阿里什 Al `Arish"]);

    dsy.add("0_27", ["麦哲伦-智利南极大区 Magallanes y de la Antártica Chilena", "塔拉帕卡大区 Tarapacá", "安托法加斯塔大区 Antofagasta", "阿塔卡马大区 Atacama", "科金博大区 Coquimbo", "瓦尔帕莱索大区 Valparaíso", "奥伊金斯将军解放者大区 Libertador G.B. O'Higgins", "马乌莱大区 Maule", "比奥比奥大区 Bío-Bío", "阿劳卡尼亚大区 Araucania", "湖大区 Los Lagos", "伊瓦涅斯将军的艾森大区 Aisén del GCLDC", "河流大区 Los Ríos", "阿里卡和帕里纳科塔大区 Arica y Parinacota"]);
    dsy.add("0_27_0", ["圣地亚哥 Santiago", "塔拉甘特Talagante", "梅利普拉Melipilla", "圣波尔那多San Bernardo", "马伊波 Maipo", "阿尔托港Puente Alto", "科迪勒拉 Cordillera", "科利纳Colina", "查卡布科 Chacabuco", "威廉姆斯港Puerto Williams", "智利南极 Antártica Chilena", "波尔凡尼尔Porvenir", "火地岛 Tierra del Fuego", "蓬图阿雷纳斯Punta Arenas", "马加兰尼斯 Magallanes", "纳塔莱斯港Puerto Natales", "乌尔蒂玛-埃斯波兰萨 Última Esperanza"]);
    dsy.add("0_27_1", ["伊基克 Iquique", "Tamarugal", "Pozo Almonte"]);
    dsy.add("0_27_2", ["安托法加斯塔Antofagasta", "托科皮亚Tocopilla", "卡拉马Calama", "洛阿El Loa"]);
    dsy.add("0_27_3", ["科皮亚波Copiapó", "查尼亚拉尔Chañaral", "科皮亚波 Copiapó", "巴耶纳尔Vallenar"]);
    dsy.add("0_27_4", ["拉塞雷纳La Serena", "艾尔基 Elqui", "科金博Coquimbo", "里马黎 Limarí", "奥瓦耶Ovalle", "乔帕 Choapa", "伊拉帕尔Illapel"]);
    dsy.add("0_27_5", ["瓦尔帕莱索Valparaíso", "帕托尔卡 Petorca", "拉里瓜La Ligua", "洛斯安第斯 Los Andes", "圣菲利普San Felipe", "基洛塔 Quillota", "瓦尔帕莱索Valparaíso", "维尼亚德马 Viña del Mar", "基尔普亚 Quilpué", "圣安东尼奥 San Antonio", "帕斯库阿岛Ísla de Pascua", "汉加罗亚Hanga Roa"]);
    dsy.add("0_27_6", ["兰卡瓜Rancagua", "卡查波阿尔 Cachapoal", "卡德纳尔卡罗 Cardenal Caro", "皮钦勒姆Pichilemu", "科尔查瓜 Colchagua", "圣费尔南多San Fernando"]);
    dsy.add("0_27_7", ["塔尔卡Talca", "库里科Curicó", "利纳雷斯Linares", "考克内斯Cauquenes"]);
    dsy.add("0_27_8", ["康塞普西翁Concepción", "努布雷 Ñuble", "奇康Chillán", "比奥比奥 Biobío[", "康塞普西翁 Concepción", "比奥比奥 Biobío", "康塞普西翁 Concepción", "塔卡胡亚诺Talcahuano", "阿劳科 Arauco"]);
    dsy.add("0_27_9", ["特木科Temuco", "马雷科 Malleco", "安戈尔Angol", "考丁 Cautín"]);
    dsy.add("0_27_10", ["蒙特港Puerto Montt", "奥索尔诺 Osorno", "奇洛埃 Chiloé", "兰奇胡亚 Llanquihue", "卡斯特罗Castro", "帕雷纳 Palena", "查伊滕Chaitén"]);
    dsy.add("0_27_11", ["科伊艾科Coihaique", "艾森港Puerto Aisén", "卡雷拉将军 General Carrera", "智利奇科Chile Chico", "普拉特海军上尉 Capitán Prat", "科奇兰Cochrane"]);
    dsy.add("0_27_12", ["瓦尔迪维亚Valdivia", "兰科 Ranco", "拉尤宁 La Unión"]);
    dsy.add("0_27_13", ["阿里卡Arica", "普特雷Putre", "帕里纳科塔Parinacota"]);
    
    changeRegion(0);
    updateRegion();
})(window.jQuery, window);
